[
  {
    "id": 1,
    "title": "Don’t drop it - Let’s start simple!",
    "content": "Sit in a chair in front of your sub.Have him on his knees with his hands tied behind his back.Place a [remote control toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) in his ass.\n\nAsk him to describe how sexy he finds you.Tell him you want to hear how much he worships you.\n\nThen remove your panties and hang them off his hard cock. Start to mastrubate.\n\nWhile you mastrubate he is going to continue saying how sexy he finds you.\n\nIf he at any point drops your panties or starts to repeat himself, punish him.\n\nMaybe he will not be allowed to cum.Or maybe he will not be allowed to fuck you."
  },
  {
    "id": 2,
    "title": "Ice Ice baby - Place a steel or glass dildo in the fridge before play.",
    "content": "Then tease him with it and tell him that it’s going up his ass. Obviously having it cold will not be very nice.\n\nSo tell him to suck on it to heat it up.But he only has 10 sec to do so.\n\nThis is always great fun watching your sub suck on the dildo like theres no tomorrow.\n\nGreat as a punishment!"
  },
  {
    "id": 3,
    "title": "A lion in the bedroom - Time for some kinky sex.",
    "content": "In this scene your are going to have sex normally but you are going to be in complete control.\n\nSpank his Ass. Spit on his face. Bite his dick. Pull him into different positions by his hair. Call him names.\n\nWhen he cums ruin his orgasm!"
  },
  {
    "id": 4,
    "title": "Massage - Tell him that he is going to prepare the best massage you have ever experienced.",
    "content": "Tell him that you expect it to be at least 40 minutes long and that you want to be impressed.\n\nA good massage could include:\n\nFull body massage with oils, candles, soothing music, fruits, chocolates, relaxing essence\n\nWhen the massage is over the scene is over.Everything does not have to be sexual."
  },
  {
    "id": 5,
    "title": "Who Makes the Rules here?  - This is a ‘’Bitch scene’’. I came up with this one because my sub masturbated without my permission and I got mad.",
    "content": "Start by laying in bed and initiate normal sex the way you usually do. Kiss his neck, touch his body you know the usual stuff. Work him up to think that you are just going to have normal sex.\n\nThen start the conversation.\n\n‘’Baby, have you been a good sub for me?’’‘’Have you not been cheating and mastrubating without my knowledge.’’\n\nWhen he admits to have mastrubated.Change tone immediately! Be angry and show him what he did is not okay!\n\n‘’What!? Are you fucking kidding me!!’’\n\n‘’Get up and kneel!’’\n\nForce him out of bed and have him kneel Infront of you.\n\n‘’Stay here and don’t fucking move!’’\n\nGo to your toy box and get a whip, lube, [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) and a [chastity cage.](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) If you want to dress sexy do, take you time. He most definitely can wait.\n\nWhen you’re done come back tell him to close his eyes.Stand in front of him and ask.\n\n‘’What are our rules?’’\n\n‘’ Is there something that you don’t understand with our rules?’’\n\n‘’And what happens when you don’t follow the rules?’’\n\n‘’That’s right baby I will decide a punishment and punish you’’\n\nHold the [pegging kit ](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html)in one hand the [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) in the other.Tell him to open his eyes.\n\n‘’Now baby what should I do? I could peg you and then ruin your orgasm. Or I can put you in chastity for a week and then make you beg to cum?’’\n\nLook at him like you want an answer.Even if he doesn’t give an indication to what is the best.Pretend that you heard him say something.\n\n‘’The fucking the nerves you have… did I ask for your opinion?’’\n\nSince he can’t keep his mouth shut when he should.You will do both!\n\nStart by [pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) him.and while you’re [pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) him make him repeat the rules to prove that he knows them!\n\nThen spank him 30 times with you whip.Have him count every hit out loud.\n\nThen have him make you cum in any way you want.with his mouth, fingers, dick anyway you want.\n\nAfter that you are done place him in chastity for the week!He will definitely learn his lesson after this!"
  },
  {
    "id": 6,
    "title": "The Coin Flip - Perfect ending scene!Make your sub Edge for you at least 10-15 times in a row.",
    "content": "Then bring out a coin:\n\nHeads he gets to cum, Tails stop immediately. Better luck next time honey.\n\nThis is allot of fun if he has been in Chasity before the scene.\n\nIf he loses place him in chastity again.And have him try his luck again the next day.\n\nIf you want to, you can extend the chastity by blindfolding him.then simply lie about the result of the coin flip."
  },
  {
    "id": 7,
    "title": "Stay Down - This is a body worship scene.",
    "content": "Sit in a chair or on the side of the bed.\n\nHave him on his knees worshipping your feet with massage and kisses. Don’t let him progress up onto your legs. Let him stay there and beg to kiss your legs!\n\nThen when you see fit ask him:\n\n‘’Who do you worship?’’‘’Repeat our rules’’‘’ Are you my bitch?’’\n\nThen let him progress to massaging your legs.\n\nThis scene is so so great as the start to your scene. Or just if you want a foot rub with a femdom twist.\n\nTo spice it up place a [remote control toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) in his ass and play with him while you enjoy your foot massage.\n\nAlternatively use this as a punishment. Tell him he has not earned to kiss you or your body. He has not even earned to kiss your asshole."
  },
  {
    "id": 8,
    "title": "The Surprise Ending - Have sex like you’ve probably done a million times, and do all your normal things.Don’t do anything Dominant, just do what you normally do.",
    "content": "But when he cums surprise him by making him clean you with his mouth.It works best if he has no idea it’s coming (pun intended).\n\nRemind him of your rules and tell him that you expect him to obey. Do not let him off the hook."
  },
  {
    "id": 9,
    "title": "Wax play - Super fun and really sexy! You can totally use normal candles. But to be on the safe side I recommend to use BDSM or massage candles. They have a low melting point. But they still got a sting!",
    "content": "Below is a punishment scene which is one of my favourites for play!\n\nGet a candle and have him lay flat on his stomach.Take the candle and put it in his ass.\n\nWhisper in his ear ‘’Do you like fire?’’Then light the candle!\n\nTake a step back and just look at how sexy this is!!! A candle sticking out of his ass, with the flame on top! Ooh my god!\n\nWhile the candle is burning take your whip and run it over his Body. Over his back, over his arm, over his ass… wait until you see the candle start to melt.\n\nWhile you wait ask him ‘’Are you gonna be a good slave for me?’’Squat in front of his face.‘’You see this pussy? This pussy deserves to be worshipped’’‘’How much do you want to worship my pussy?’’\n\nLift his head up and stare him right in his eyes.Place your whip in his mouth and order him to not drop it.\n\nThen take the candle out of his ass.And start to pour it all over his body.\n\nDrip it on his ass and back.Take your time and drip it sloow.Try writing your name on his back with the dripping wax.\n\nWait for the wax to become stale.Then grab you whip from his mouth.\n\nAsk him if he is ready for his punishment.\n\nThen whip the wax off his body.When every bit of wax is gone you are done!\n\nAfter this continue your scene however you want."
  },
  {
    "id": 10,
    "title": "A devastating Handjob - A great hand job scene is perfect when you don’t want sex. To make the hand jobs a little more fun here are some great techniques to use!",
    "content": "A.) Over the top : Start by stroking him up and down with your hand as you normally would.\n\nWhile stroking him up and down, rub your thumb over the back of the head of his penis.\n\nSo your hand is stroking him normally while your thumb is focusing only on pleasuring the top of his penis. Simple.\n\nThis is the most sensitive spot on his penis. Watch him squirm with pleasure.\n\nB.) Over the top double handed : Same as before one hand will jerk him normally but the other hand focuses on the head of his dick.\n\nGet creative with the hand pleasuring his dick head. For example\n\nWith fingers loose, run the tips of them over the head and then back again.\n\nUse the tip of one finger to make small circles around the tip of his penis\n\nC.) The Escalator - Use a lot of lube for this one.\n\nTo start take your right hand and stroke him from the top to the bottom.When you reach the bottom let go of his penis and do the same movement with your left hand. Start from the top and go to bottom then remove your hand.\n\nNow continue doing this, left, right, left, right.He will experience a never ending sensation!\n\nD.) The Twist : Lube again!\n\nGrab the bottom part of his dick with one hand and grab the top part of his penis with your other hand so that both hands are holding it. Don’t worry if your bottom hand is holding most of his penis and his second hand doesn’t have much to hold.\n\nWithout applying much pressure, rotate one hand in a clockwise direction around his penis while rotating your other hand in an anti-clockwise direction.\n\nWhen you can’t turn your hand any more, change direction and rotate each hand as far as possible in the opposite direction.\n\nThis sounds like quite a slow process, but it is much more pleasurable the faster you do it.\n\nE.) The Ring : This is super simple.\n\nYou just need to make an ‘O’ shape by touching the tip of your index finger to your thumb.\n\nThen instead of wrapping your whole hand around your man’s shaft, use only the ‘O’ and then stroke him up and down with it.\n\nMake him beg for you to use your entire hand!\n\nF.) Palming - Rub the palm of you hand over his head. Do it slow and fast. This is great as post orgasm torture.\n\nG.) Milking & Sucking - An awesome way to suck your man’s balls while giving him a hand job.\n\nHave him on all four and stand behind him. Pull his dick down so it faces the floor and jerk him off.\n\nIn this position, his balls will also be exposed, so it’s perfect for sucking him. Take his balls in your mouth while using your hand to jerk him off.His ass is also totally exposed for you to play with!\n\nGet Dildo or [buttplug](https://www.lovehoney.eu/sex-toys/butt-plugs/jewelled-butt-plugs/p/lovehoney-jewelled-metal-beginners-butt-plug-2.5-inch/a40364g73767.html) and go wild!\n\nP.s Remember Lube make all these more fun and take it slooooowwwwww. The longer you take the more desperate he will become."
  },
  {
    "id": 11,
    "title": "Jerk off instructions (JOI) - Give him instructions for how to jerk off.Tell him when to start how fast to go, when to stop, how deep to stroke and so on.Enjoy the show or do it over the phone.",
    "content": "if you want to assert your dominance have him taste or swallow his cum when he’s finished.\n\nThis is an entire category of porn so you can get some tips from JOI videos online."
  },
  {
    "id": 12,
    "title": "Up all night to get lucky -  A fun dice game.",
    "content": "Roll a dice. The sub does not get to see what the score is. The score determines the result of the evening for the sub.\n\nIf you score 1 - Bad luck for the him. After you orgasms, all play stops. No pleasure for the him.\n\n2,3 or 4 - Get him to the edge. When he’s about to cum, he must beg you to stop. The score he got determines how many times he will edge before play stops. No cumming for him.\n\n5 - After 4 edges, continue but instead of a fifth edge, Bring him to orgasm - But ruin it.\n\n6 - After 5 edges, continue but instead of a sixth edge, Give him a full orgasm."
  },
  {
    "id": 13,
    "title": "Goddess Day - Make an entire scene about you and explore more of worshiping.Here are some examples of things he can do for you.",
    "content": "Run a bathtub and bring chocolate and strawberriesMassage your entire body Head to toes.Paint your toe nails.Cook your favourite dinner.Bring you to orgasm with no return favour."
  },
  {
    "id": 14,
    "title": "Edging - Tonight is going to be all about stamina and will power. Before he is allowed to cum have him edge at least 15 times!",
    "content": "Each time he edges he must say why he deserves to cum, how much he worships you, and what he would do if he was allowed to cum.\n\nAnd remember this is still about you. So obviously he can not expect to get to cum until he has satisfied your every need.\n\nDon’t tell him in advance how many times he must edge for you. And before giving him that sweet release make him beg for it!\n\nA fun thing to do is to play with his answers as he gets more and more desperate to cum.\n\nHe might say ‘’i’ll do anything if you let me cum!’’\n\nAnswer him ‘’like what?’’\n\nSee what he says. Make him do what ever he offers you. ;)"
  },
  {
    "id": 15,
    "title": "Riming - Something I love is a good rim job.I love to get a rim job right after I step out of the shower. I turn on my favourite series on Netflix or catch up on my text messages and have him just massaging my anus with his tongue.",
    "content": "Here area few Ass worship positions to try out:\n\na.) The ‘Sandwich’: Start by lying on your stomach with the ass facing upward. Your sub will now eat you out while you watch your phone or just relax. Don’t forget to grab you subs hair push him into your ass to show him who is in charge.\n\nb.) Back to the Wall: Your sub is gonna sit on the floor with their back to a wall. You stand Infront of him and tease him with your ass.This is great if he has his hands tied behind his back.Also great as a tease starter for a scene.\n\nTell him to stick his tongue out for you!And the tease him.\n\nC.) The Chair: Another way of enjoying ass worship is for you to sit on a chair with your ass hanging off the side. Then have your sub get on his knees behind you and eat you out."
  },
  {
    "id": 16,
    "title": "Pinhead- If you don’t have a [Pinwheel](https://www.lovehoney.eu/bondage/electro-medical-fetish/pain-sensation-play/p/fifty-shades-darker-adrenaline-spikes-metal-wartenberg-pinwheel/a35197g63954.html) you should totally get one!here is a super fun way to use them in a scene.",
    "content": "Tie him to a chair with his hands behind his back, [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) and [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him.Then start to roll the pinwheel over his body.\n\nGo harder and softer all over his body.\n\n‘’Are you going to be a good boy for me?’’\n\nStart to roll the pinwheel over his dick head.Use different amount of pressure on his dick.\n\nNow you are going to alternate teasing his dick with your mouth.and rolling the pinwheel all over his penis.\n\nSee how long he will last until he begs you to stop.\n\nPlace the pinwheel in the fridge before you start to play. The cold will make it seem much sharper than it actually is.\n\nYou can do this with a steel butter knife to make it seem like a super sharp object too."
  },
  {
    "id": 17,
    "title": "Make them Shine! - Another Dom worship scene!For this scene you need some knee high boots or High heels!",
    "content": "Sit in front of your sub and ask him if he thinks he can lick you to an orgasm?Well you don’t think so.. why don’t he prove it!\n\nTell him to lick your boots, and make them shiny.While he is doing this you’re in perfect position to spank his ass with a whip. Or to mastrubate infront of him.Tell him to hurry up and impress you.Otherwise you will cum and he will not be allowed to taste you!\n\nThis can also be a perfect opportunity to lay out the rules for your scene.\n\nIf he even comes near to kiss your leg.Spank him hard and tell him he has not earned to kiss your legs yet!\n\nWhen you are satisfied with the job.\n\nPut your legs on his shoulders and push him towards your pussy.and have him lick you to an orgasm. Then continue your scene with whatever your want.\n\nBONUS: When you are done with your scene give him an option.\n\nHe is allowed to cum. BUT only on you shoes. And he has to lick them clean. And you want them fucking shining!\n\nSee what he chooses. ;)"
  },
  {
    "id": 18,
    "title": "When I’m back - Go run an errand or have a girls night out.but tell your sub that when you come back you want him to be:",
    "content": "Shaved, naked, wearing your favourite [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html), on his knees with a big butt plug in his ass and your favourite whip in his hands and he should be waiting for you by the door.\n\nDon’t tell him when exactly you will be back.This will keep him on his toes for when you come home.\n\nWhen you do come home, inspect your sub and then start your scene.\n\nOr you can inspect your sub when you come home. But not start a scene! Just say ‘’Good job, now get dressed”"
  },
  {
    "id": 19,
    "title": "Hurry up! - Have him perform a task for you like oral, a massage or a rim job. When you are satisfied tell him he is going to be rewarded.",
    "content": "Set a timer for maybe 3 minutes. In this time he has to cum.you can make it as hard or as easy as you like.Wanna make it hard?\n\nHe is not allowed to touch his dick with his hand.\n\nWanna have some fun? Place a [Fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) on the floor and see him struggle to get his dick inside it as it slides around on the floor!\n\nSpank him while he is trying to cum!\n\nIf he fails, tell him you’re disappointed and that you wanted to see him to cum. Ask him if he is sorry and then punish him with 30 spanks.\n\nWhile you spank him play with his dick and have him tell you why he should deserve to cum."
  },
  {
    "id": 20,
    "title": "Double penetration - This is one is one of my absolute favourites. For this I recommend to get a [Dildo with a suction cup.](https://www.lovehoney.eu/search?q=suction+cup+dildo&search-button=&lang=en_IE)",
    "content": "Tell him he is going to earn to fuck you.Then place a dildo on the floor and tie his hands behind his back. Have him ride the Dildo. While he is riding the dildo he is going to perform oral on you. if he ever looses pace or he cant please you to your standards spank him with your whip.\n\nNow turn up the heat even more! When you are satisfied untie his hands and tell him to lean back While keeping the dildo in his ass. His hands should be touching the floor.\n\nThen start to ride him, and ride him hard, fuck his brains out.Every time you bounce he will ride the Dildo.Double Penetration Femdom Style!\n\nThis is so so hot I love this one."
  },
  {
    "id": 21,
    "title": "Set the Scene - Have him set the scene. Give him instructions on what you will need for the scene and how you want it set up. [Bed restrains](https://www.lovehoney.com/search?q=bed+restraints&search-button=&lang=en_US), [dildos](https://www.lovehoney.com/search?q=dildos&search-button=&lang=en_US), [buttplugs](https://www.lovehoney.eu/sex-toys/butt-plugs/jewelled-butt-plugs/p/lovehoney-jewelled-metal-beginners-butt-plug-2.5-inch/a40364g73767.html) you name it.",
    "content": "Obviously don’t say what you will actually do. You should also have him place out things that you won’t actually use. For example have him place out the largest dildo you have, or that one whip that he don’t like. have him place out a[ pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html). Who said anything about using it right?"
  },
  {
    "id": 22,
    "title": "Ruined Orgasm - Another technique that I love! Can be used alone or in conjunction with edging. At the moment he reaches orgasm, stop touching him completely. Don't let him touch it anymore either. Just let his orgasm happen with no extra help.",
    "content": "This is also a great compromise. I love to see cum squirt from my BFs dick. But what if he hasn’t earned a full orgasm? Why should I suffer for that? Ruin his orgasm, you get to enjoy a show and he will try even harder next time you play!\n\nThe great thing with this technique is that you can make him come several times! Just wait 10-15 second and the start again."
  },
  {
    "id": 23,
    "title": "Everyday I’m bossing him - Get a [remote controlled toy ](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html)and place it in his ass.",
    "content": "Now whenever you need something give him a buzz.\n\nWant a cup of coffee - Buzz\n\nWant lunch? - Buzz\n\nWant Some attention? - Buzz\n\nIts Perfect why did I come up with this now!"
  },
  {
    "id": 24,
    "title": "How many times can you cum - Tie him up and see how many times he bears to cum before begging you to stop. Remember you must always ruin his orgasm so he can continue. And remember to wait maybe 10 -15 second before you start jerking him off again. The last time you make him cum give him a full orgasm and enjoy the show or cum flying everywhere!",
    "content": "My personal record is 6 cumshots.See if you can beat that. ;)"
  },
  {
    "id": 25,
    "title": "The Adventure - In this game your sub will have to answer questions that he have not heard. He can only answer ‘’Yes’’ or ‘’No’’. Depending on his answer your scene will look different.",
    "content": "Start by just having him say Yes or no and then have fun.\n\na.) I will give Miss a full massage\n\nb.) I will wear a buttplug for the entire scene\n\nc.) I will give miss Oral\n\nd.)I will not be allowed to look miss in the eyes\n\ne.) Miss will allow me to fuck her\n\nf.) Miss will use a dildo in my ass\n\ng.) Miss will Spank me 25 times\n\nh.) I will be tied up\n\nI.) I will be wearing a ballgag\n\nJ.) I will only be allowed to ruin my orgasm\n\nYou can make your own questions but this is a start."
  },
  {
    "id": 26,
    "title": "RimShot - Make him cum on your anus and have him lick it up.",
    "content": "You can use this as a setup while you’re in a scene!\n\n‘’Do you wanna cum baby?’’‘’But you don’t deserve to cum.’’‘’Ill let you cum but you have to clean it up with your mouth, okay’’\n\nWhen he says yes.\n\n‘’Good! Cum on my ass, and lick up.’’\n\nJust before he is about to cum tell him to ruin it!\n\n“Ruin you orgasm!”\n\nSuper sexy and super kinky!"
  },
  {
    "id": 27,
    "title": "Put on a show for me - This is a power scene.Start by pouring yourself a glass of champagne or whine. Then place some toys on the floor.",
    "content": "It can be anything ex. a [Dildo](https://www.lovehoney.eu/search?q=suction+cup+dildo&search-button=&lang=en_IE), [Fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html), a [penis pump](https://www.lovehoney.eu/sex-toys/penis-extenders-enlargers/penis-pumps/p/tracey-cox-edge-ultimate-performance-stamina-penis-pump/a28656g46571.html) and lube.\n\nYou can also place non sexual things like panties, fruit, chocolate or whipped cream.\n\nTell him that you want to be entertained and if he does a good job he will be rewarded.\n\nThen set a timer and enjoy the show.Don’t be afraid to give out orders like.\n\nThe key here is to really enjoy yourself. Play music, give orders, take the bottle of champagne and pour it in his mouth.\n\nOrders can be things like ‘’Fuck your ass faster!’’ Or “Pump it more! I want to see you dick explode!”\n\nSit back with a whip and just enjoy the show.I always gets such a power rush from this.\n\nEnjoy the show!"
  },
  {
    "id": 28,
    "title": "Your not worthy - Has he not deserved your wonderful pussy? Or maybe he does but you don’t feel like having sex?",
    "content": "The great thing with [Fleshlights](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) are that they are much easier to use for teasing than you pussy. You can tease him with just the tip of his dick before pushing it all the way in.\n\nTie him up and [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) him and tease him the [Fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html). Make him beg for you to use the full fleshlight!\n\nBonus: don’t forget that these are great for post orgasm torture as well!"
  },
  {
    "id": 29,
    "title": "Question Time - How well does your sub know you? create a quiz with questions about you and your desires. If he really worships his goddess he should know everything about her right?",
    "content": "For every wrong answer spank him or ruin his orgasm. Or for every answer he has wrong no orgasm for that amount of days.\n\nA fun Twist to this is to not tell him the answers he got correct or wrong. Just tell him the total score i.e 11/20. This will mean that he has to study everything about you not knowing where to start. This is a great way to keep him always interested in your conversations."
  },
  {
    "id": 30,
    "title": "Be careful what you wish for - Post orgasm torture is when you just continue to fuck, jerk or blow a dick that already has cummed. This result in overstimulation which is described as a very strong tickeling feeling and eventually another orgasm.",
    "content": "When your sub begs you to let him cum. Continue to jerk him off after he has cummed. He will have a hard time controlling him self from over stimulation.\n\nWhisper in his ear ‘’I thought you wanted to cum’’. So so HOT!!"
  },
  {
    "id": 31,
    "title": "Your body is a wonderland - Set a timer and promise him that if he can worship your body to your satisfaction before the time ends you will reward him! He can satisfy you in any way he likes but not touch your pussy. If you think he does a good enough job reward him if not, don’t.",
    "content": "However remember that a reward can be both small and big!Some might consider unlimited access your body a reward in it self. So you can give him a kiss and call that, a reward and next time give him a blowjob. This will ensure always does his best and never knows what to receive."
  },
  {
    "id": 32,
    "title": "Close the gap - This one is designed to help you with a sub who mastrubates too much or has been allowed to cum more than you.",
    "content": "Tell him that he will not be allowed to cum until he has made you cum x amount of times.\n\nyou can set a high number that will span several sessions.or you can set a low number that possible to get too but only if he concentrate.\n\nI usually say 3 - 4 orgasm rewards him with 1.\n\nIf your sub is mastrubating and has not been following your rules. Put a [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) on his dick. Only allow him not to wear it when he has learned not to cum without your permission."
  },
  {
    "id": 33,
    "title": "Snowball - Deny your sub’s orgasm for an entire week. Then tie him up and reward him with a nice blowjob, or if you want to make him do the work just catch it with your mouth as he jerks off.Then Slowly, very slowly, work your way up his body and give him a big kiss. The longer it takes you to touch his lips, the more his libedo will have subsided. Once your lips connect, push his cum into his mouth. Let him feel the amount of the seed he has been saving for the entire week.",
    "content": "When it’s in his mouth look him deep in his eyes and say.\n\n‘’Be a good bitch for me and swallow it baby.’’"
  },
  {
    "id": 34,
    "title": "Oral - Tell him that he is going to make you cum from oral tonight.But you want an experience!",
    "content": "He is to make you cum with his mouth in a new and unique way.He should impress you with his new skills!\n\nBefore tonight he should have studied new techniques and positions. And be prepared to take you to heaven.\n\nIf he cant impress, he will be punished!"
  },
  {
    "id": 35,
    "title": "The Blowjob - Has your sub been super good and you want to reward him. This scene is for you!",
    "content": "Start by tying him up to a chair. Make sure that it’s really tight so that he can’t move. I recommend using [BDSM Tape](https://www.lovehoney.eu/bondage/handcuffs-restraints/bondage-rope-tape/p/lovehoney-black-bondage-tape/a71g71.html) since it makes this much easier and faster.\n\n[Blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) him and Start to tease him.Walk around the chair so he don’t know exactly where you are.\n\nWhisper in his ear and touch him from behind.Tease your way toward his dick.Take you time.\n\nThen when he can’t wait any longer start to give him a devastating blowjob!\n\nReally a hot scene and adds a bit of Femdom into a blowjob!\n\nBonus: Take a zip champagne or sparkling candy before you suck his dick, the bubbles with give a crazy sensation for him."
  },
  {
    "id": 36,
    "title": "Hug the wall - Have him hold a pennies to a wall with his nose and fingers.He going to hold one penny with each of his fingers and one with his nose.",
    "content": "you can use this as a position while you spank him. Tell him that for every penny he drops will add 10 more spanks.\n\nP.s If you have a [Cock leash](https://www.lovehoney.eu/bondage/cock-ball-toys/ball-stretchers-dividers/p/dominix-deluxe-leather-ball-strap-with-lead/a35602g65086.html) you can pull on it as you make your last hit! That will lead him to drop all of the pennies.\n\nI know I’m a bitch. ;)"
  },
  {
    "id": 37,
    "title": "Locked Away - This is a Chasity idea that can last however long you want.",
    "content": "Place your sub in a [chastity cage ](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE)but lock him up with a combination lock.\n\nNow make him earn each digit one by one!\n\nThis can span how ever long you want.for example, If its a 4 digit lock make a system that if he is good each week.\n\nHe gets 1 digit every week for one month."
  },
  {
    "id": 38,
    "title": "Let's go! - This is a setup scene which can help you initiate play. Prepare the scene that you want to do. But make sure your sub have no idea that you are planing something.",
    "content": "Then get a [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) and sneak up behind him.from behind place the [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) in his mouth and whisper him to kneel but not look at you.\n\nTell him to strip naked, then place a [collar and a leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) on him.Tell him that he will crawl to the bed room.\n\nWhen he enters the room kick the door shut and start your scene."
  },
  {
    "id": 39,
    "title": "The O Race - Challenge your sub to a masturbation race.",
    "content": "You can of course cheat. Like warm up before you initiate the race so you are already quite close even before you start. Or just fake your orgasm. If he asked how you could cum so quick. Tell him that this is your favourite vibrator for a reason. ;)\n\nSpice it up with a punishment for losing.\n\nHere are some ideas.\n\nNo cuming for 5 days.He gets to cum but he has to ruin it and swallow it.[Pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html)SpankingMassage and body worship for you."
  },
  {
    "id": 40,
    "title": "Locktober and No Nut November - If you want to see how far you can take the no cumming idea. Try the challenge of a month of play but No cumming! For him that is. Locktober is as the name suggests about Chasity. But if you’re not into that November might be more your thing.",
    "content": "The point of these months is that nothing should change for you. If you want to have sex, have sex, If you want to play with his dick do, if you want to cum from oral do. Just remember no cuming for him.\n\nHonestly this as hard for me as it is for him. Something that I like to remind him of after 24 days of teasing. And btw you can do this in July or mars as well. That way he have had some practise before locktober or no nut November."
  },
  {
    "id": 41,
    "title": "Not tonight - Have a full scene were you don’t touch his dick.There are plenty of things that does not involve his dick.",
    "content": "Remember that Femdom is all about you!There are several thing you can do that does not involve his dick.\n\nOralhave him fuck you with a strap onMassage for youPeggingSpankingTeasing"
  },
  {
    "id": 42,
    "title": "The most evil Scene ever - So your sub is in chastity.and you want to be a bitch? Well this is your scene!",
    "content": "In the morning whispering in his ear.\n\n“I want your cock and hot cum in my mouth tonight”\n\nHe is going to get super hyped about being allowed to cum.\n\nWhen the night comes and it’s time for his blowjob.\n\nStart to tease him with your mouth and with dirty talk. Then start to suck his dick BUT don’t remove the chastity cage.\n\nIf he can cum from this great. But if he can’t then stop say your disappointed. And that you wanted his hot cum.\n\nThen Start to rub your Pussy on his chastity cage.Rub it all over and say how much you want his dick.\n\nThen Start to rub you pussy with your hands.\n\nWhen you start to get close say.\n\n‘’Baby, I wanted us to cum together!’’"
  },
  {
    "id": 43,
    "title": "Concentrate! - Get into a 69 position and have him pleasure you with whatever you like oral, toys, fingers you’re the boss.",
    "content": "While he is doing this give him a blowjob. Start very very very slow maybe just breath on it. Or have it in your mouth but not sucking on it. but with time intensify.\n\nIf at any point the quality of the pleasure you get drops.\n\nStop blowing him and tell him that he clearly can’t handle your amazing blowjob. So you will stop so he can focus better on you.\n\nOnly when you feel like giving him more start again. But when you do. Start again agonizingly sloooww."
  },
  {
    "id": 44,
    "title": "A Week of Femdom - Most couples are actually switches. Which means sometimes you Dom and sometimes he Dom. It’s quite rare that people have a 24/7 Femdom sex life.",
    "content": "But try it out! Have a week of Femdom. You don’t have to have sex every day. There are many scenes that are non-sexual. For example have him treat you to a Spa-night at home, or have him make you a five star dinner complete with a menu. The sky is the limit.\n\nBut make sure that he knows who is boss for this week!"
  },
  {
    "id": 45,
    "title": "Make it happen - Tell your sub that he can cum but only if he can do it without using his hands… if he fails no cuming this session.",
    "content": "Don’t forget to set a timer.\n\nyou can decide if sex with you is an options. if it is don't tell him. see if he can figure that out. Then when he fails to cum. Tease him and ask why he didn't try to fuck your sweet sweet pussy. That was a lost opportunity that rarely comes. ;)\n\n&#x200B;"
  },
  {
    "id": 46,
    "title": "Dinner With A Dildo - When you get a chance, why not surprise your sub with dinner? I know you want to make it special, so when he walks in the door greet him wearing something sexy and then ask him to strip before he comes any closer.",
    "content": "On his chair have a dildo and lube ready for him. He must sit in the seat, and on the dildo for the whole meal."
  },
  {
    "id": 47,
    "title": "Amazon positions - Amazon positions is where the woman is thrusting instead of the man. This is a great way of showing him who’s boss.",
    "content": "You can start with simple ones like reversed missionary before you graduate to more advanced positions. There’s even a position called the amazon position which is amazing but quite hard to perform.\n\nTwist to this is if you have a sex swing instead of you being in it. Have him be in it and fuck him. A great resource for positions are kinkly and cosmopolitan. They offer female on top positions, regular positions and [pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) positions.\n\n[https://www.kinkly.com/sex-positions](https://www.kinkly.com/sex-positions)[https://www.cosmopolitan.com/sex-love/positions/](https://www.cosmopolitan.com/sex-love/positions/)\n\nThese can be used to create a scene.Control how much pleasure he gets, Tease him, go slow, go suuupper slow. Or fuck his brains out your choice."
  },
  {
    "id": 48,
    "title": "Try to Cum - Place your sub in a [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) and put a strong vibrator on it like [Wand vibrator](https://www.lovehoney.eu/search?q=wand&search-button=&lang=en_IE). Tell him that he is allowed to cum. IF he can to do it!",
    "content": "Now enjoy the show of matching him finger his ass, hump a pillow, try to mastrubate all while still in the cage!\n\nSuper evil and very fun!"
  },
  {
    "id": 49,
    "title": "Not Your Dick - Have him wear a [strap on](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) and tell him to fuck you good! Why should you have to suffer not having a good fuck just because he hasn’t earned a place inside his Goddess?",
    "content": "Imagine his poor agony at doing all the work and not even being able to touch you in the way he wants.If he cant pleasure you in the way you expect, punish him.\n\nAn idea for punishment if he cant fuck you like you want is to stop him.Grab his face look him straight in his eyes and say.\n\n‘’Since you can’t fuck me like a good boy. I’m going to fuck you until you”\n\nThen tell him to remove the [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html).Put it on, Lube up and fuck him!\n\nWhile you fuck him ask him!\n\n‘’Are you going to do a better job next time?’’"
  },
  {
    "id": 50,
    "title": "You better be quick- Lock your sub up with his hands behind his back. Then have him undress you with only his teeth.the catch is that he has to be quick because you’ve set a timer!",
    "content": "If he can do it before the timer. He gets to cum at the end of the scene.\n\nI love to do this if we're in the middle of a month without cuming. I tell him that if he can do it before the time runs out. I’ll let him fuck me anyway he wants and cum!"
  },
  {
    "id": 51,
    "title": "Make it real good - Start by teasing your sub and jerking him off. You can choose if your are going edge him or just play a bit with his cock to get him somewhat close to an orgasm.",
    "content": "Tell him that you want him to fuck you hard and to make you cum.Tell him he is not allowed to stop fucking you until either he cums or you cum.\n\nIf he Cums he should cum on or inside of your pussy. After he will give you oral until you Cum.\n\nNice and simple!Perfect for when you are having sex normally and you want to spice it up a bit!"
  },
  {
    "id": 52,
    "title": "My Dick - [Pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) is by far the most empowering thing I’ve ever done.If I where to give you one thing on this list that you have to try Its [pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html)!",
    "content": "Make him give you a blowjob, fuck him doggy style, have him ride you! Aah such much fun thing to be had!\n\nPlease do your self a favour and at least give it a try!Here is a great article by cosmopolitan with some great [positions](https://www.cosmopolitan.com/sex-love/positions/news/g5329/sex-positions-for-pegging/)!\n\nOne advice that I will give you is this. Take it slow and use more lube than you think you will ever need!\n\nNow obviously I wouldn’t leave you with out a scene, now would I?\n\nThe scene -\n\nStart by [blindfolding](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) him naked and and have him sit on the floor.start to tease him, breathe in his ear, lick on his face, touch or suck on his dick, get him super turned on.\n\nContinue to tease him and while you’re doing that start to ask him questions like:\n\n‘’Baby? Do you want to fuck me?’’‘’aha, do you want to fuck me hard’’‘’Spread my legs and fuck my tight little pussy?’’\n\nGet really close and tease him with your pussy.‘’Is this what you want?’’‘’do you love my pussy? Do you wanna fuck it nice and deep?’’\n\n‘’Well if you wanna fuck my pretty little pussy you need to let me fuck you first’’\n\nTell him to open his mouth for you.and then slide your dildo inside his mouth.\n\nTell him to suck it real good for you.Just the way that he wants you to suck his dick.\n\nThen when you’re ready tell him to turn around and to get into a position you want. And fuck his brains out!\n\nWhile you’re fucking him.Tell him how horny you get from fucking him.But also remember that he should be thankful that you the Dominant his putting all this work.\n\n‘’Do you know how luck you are to have your goddess fuck you like this?’’\n\n‘’Let me hear you say it!’’\n\nWhen you are done you can chose if you let him fuck you.Or you can tell him that he has earned the reward of getting too fuck you. But not now…"
  },
  {
    "id": 53,
    "title": "What are the rules? - Before you even start your scene today. Ensure that your sub has followed the rules and that he can repeat them back to you! If he cant punish him!",
    "content": "A fun thing to do if he failed. Is to have him guess the rules while you are punishing him. Every wrong answer that’s 10 extra spanks or 2 extra Edges. When he finally says he don’t know make him repeat the correct answer while you spank him 15 times or edge 4 times."
  },
  {
    "id": 54,
    "title": "He Has No Balls - At random during the day or before you start your scene.Walk up to your sub pull down his pans.",
    "content": "Grab his dick, tease him with your hands or mouth.\n\nThen ask him‘’Who’s dick is this?’’\n\nGrab his balls and pull them down and twist a little to one side.‘’ Who owns these balls?’’\n\n‘’Who is your mistress?’’\n\n‘’What are our rules?’’\n\nNow you can either start your scene or just tell him to pull up his pants!\n\nIf he couldn’t answer or hesitated, remember this for later."
  },
  {
    "id": 55,
    "title": "You or him? - What will he choose, to please you or to please himself?",
    "content": "Tell him to give you oral. And that if he does a good job he will ‘’earn’’ a ruined orgasm or a spanking.\n\nIf he does a bad job he earns a massage or sex. But never promise him an orgasm!\n\nWhat will he do? Please you with fantastic oral and take a punishment like a good sub? Or will he chose to do a bad job and enjoy sex or a massage?\n\nLet say he did a bad job, now what?\n\nFirst have hot sex that he don’t deserve. Enjoy it to it's full extent but whisper in his ear that you will not even consider letting him cum again until the same-day next week. Thats the price he will pay.\n\nLive up to that and make a scene where I earns his right to an orgasm! If you don’t trust he can last a week, lock him up in a [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE). Better safe than sorry!"
  },
  {
    "id": 56,
    "title": "The searcher - Tell him that he has been bad and deserves a punishment. But have him search the internet for a new punishment,",
    "content": "The scene should fit your dominance style. So it would be wise of him to bring not one but a few ideas for you to choose from.\n\nPick the one you like the most and have fun!\n\nHowever keep in mind that most subs will just bring something that would punish them but won’t please you! Double check that his punishment is not just allot of work for you!"
  },
  {
    "id": 57,
    "title": "Hard On Demand - At random times throughout the week demand that your sub show you his erect cock. You can set a time limit on how long he has to get fully hard, or leave it open ended so that he has to keep trying until it happens.",
    "content": "When he is erect compliment and tell him to put it away.‘’its not playtime yet’’ then continue with what you where doing.\n\nIf he cannot get hard take note and Punish him at the end of the week. Let’s say he couldn’t get hard 10 time you can say that now he has to edge 10 times for your. Or that you will spank him 100 times."
  },
  {
    "id": 58,
    "title": "Fuck Him Gently - Reward your sub, and yourself, with a night of genuine passion and great sex. Take the lead, of course, but make it amazing and fun. Tell him how handsome he is, how lucky you are to have him. Let him tell you what position he’d like to do…",
    "content": ""
  },
  {
    "id": 59,
    "title": "The Throne - This is real power Scene. You are going to sit in chair and place a [remote controlled Prostate toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) in his ass and have him to kneel naked Infront of you.",
    "content": "Ask him who he belongs to? Ask him who owns his dick and ass?Ask him who he worship?\n\nTell him to kiss your high heels. Tell him to lick them, make them shine.\n\nAsk him if he deserves to kiss your feet.\n\nTell him to remove your shoes and to give you a foot rub. If he does well order him to kiss them.\n\nwhen he is done have him perform oral for you, or use a toy on you.\n\nIf he does bad buzz the toy or whip him with your whip!"
  },
  {
    "id": 60,
    "title": "Now you know - This one is super simple.have sex just like you want to. Oral, Doggy you name it.don’t have to be femdom involved at all.",
    "content": "When you are done stop the action.tell him that he haven’t deserved to cum.So he will not cum tonight unless he can offer you something?\n\nHear what he offers you, if you like it make him cum.if you don’t like it, tell him he has to offer you something better.or say no and end the scene right then and there."
  },
  {
    "id": 61,
    "title": "Be A Jerk(off) - Something light and easy. Have your man strip naked and sit in a chair or even on the floor. Let him know these rules; No talking, no touching. You don’t need to tie him up because a good sub will listen and do as he is told.",
    "content": "Get your pussy close to his face and start masturbating. Get as close as you can without touching. Let him see what you do, tell him that’s how your beautiful pussy should be treated.\n\nWhen you cum, if he listened to you and not said a word or tried to touch you, inform him that he can pleasure himself after you leave the room. If he did slip up, tell him you are both done for the night and he may not masturbate for 24 hours. Remember, you control everyone’s orgasms in this relationship. Make sure he knows that."
  },
  {
    "id": 62,
    "title": "Cum dump - A Simple punishment.",
    "content": "Have him watch you use your favourite dildo or vibrator and cum right in front of him. He is not allowed to touch talk or do anything while you mastrubate. He will sit with a ball gag and be quiet until your done.\n\nThen ask him if he wants to taste you.He will say yes.\n\nHave him promise that he will be a better sub!\n\nInstead of having to taste your pussy right from the source have him taste the cum from your toy.\n\nTell him that only good subs gets to taste their goddess cum direct from her pussy. Very sexy.\n\nP.s Don’t forget to put on a real show when your pleasing yourself with your toy/toys. give that toy an amazing blowjob right in front of his a face, have him suck on it to lube it up. Be loud and make sure he knows just how good it feels"
  },
  {
    "id": 63,
    "title": "The Orgasm - Tell him that on Friday. You want him to make you cum. But he is not allowed to use any technique that he has tried before! That means he has to research new toys, fingering, oral techniques. It has to be kept fresh!",
    "content": "An alternative to this is to tell him that he will fuck you on Friday but again he is not allowed to use any old tricks or positions. only new ones! This can also be done with a massage if you’re not feeling like having sex.\n\nBut remember that what ever you go with sex, oral or a massage.it has to be good! Really good!\n\nI love to do this, it has introduces so many awesome positions into our sexlife!"
  },
  {
    "id": 64,
    "title": "Testing the Water - This scene is designed for you as a dome to learn how hard you can spank your sub.",
    "content": "Bring out a whip and start spanking your sub.after every hit he is going to give you a number.\n\n1 - 10.\n\n1 is no pain and 10 is maximum pain.\n\nThis will help you in the future to know how hard you can spank your sub."
  },
  {
    "id": 65,
    "title": "A Nice Face to Sit - Every queen deserves a throne!his face is yours.",
    "content": "Sit on his face and have him eat you out.Pull his hair or grind on his mouth.Tell him how you’re going to own him tonight!\n\nDon’t forget to turn around so you’re facing his feet. now you can play with his dick while he is licking your pussy or ass.Tease him with a feather, ice or a flashlight and play with him."
  },
  {
    "id": 66,
    "title": "A Good Fuck - This is a [Leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) scene that I enjoy when I want sex. But I’m tired after work and just don’t fell like doing something elaborate. A [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) is great because there is no question who is the boss. Yet it requires no effort to use.",
    "content": "So grab your [Leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) and put it on him.Now enjoy all of the below in order.\n\nHave him massage your head and hair. Full body massage with foot rub. Have him kiss you entire body and he should say how much he worship you.\n\nThen he should give you oral. Fuck you in the positions you like with NO effort from you. When you are done have him give you a rim job while you relax.\n\nRemember to lead him from one part of the scene to the next with your [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html). This is a relaxing scene designed for you not for him. So he should NOT expect to be allowed to cum!"
  },
  {
    "id": 67,
    "title": "Put the X in Sex - Do a scene with your your sub tied up in [a X ](https://www.lovehoney.eu/bondage/handcuffs-restraints/bedroom-bondage-kits/p/bondage-boutique-black-rose-under-mattress-restraint-kit-2-piece/a38181g70526.html)in the bed with a [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) in his mouth.",
    "content": "Here is an idea to get you started, I will leave you right after you have cummed since that’s the most important part of the scene ;)\n\ntease him, lick his ear, bite his nipples and dick.\n\nTell him how much you’re going to play with him tonight. Tell him how much you want him to make you cum. Say that you want him to make you cum with his mouth.\n\nThen get on top of him and start to grind your pussy against the [ballgag.](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) Tell him that he has to work harder and that you are not getting there. Tell him to stick his tongue out, and be disappointed when he cant. Stop and say that you are disappointed and you thought he wanted to make you cum…\n\nGet a [vibrating dildo](https://www.lovehoney.eu/sex-toys/dildos/vibrating-dildos/#pid=Tilea410g410) and suck on it while laying next to him.Ask him if he want this to be his dick.‘’well you didn’t earn it’’\n\nThen use the dildo and make yourself cum,\n\nNow start to play with his dick again.bite it, kiss it, put it between your lips.\n\nTell him that you are not done yet.And that he is not going to cum for a long long time.\n\nThen get on top of him again and start to ride him.While you are riding him use the vibrator until you orgasm.\n\nFrom here you can take the scene anywhere.Play with his dick more or put the dildo up his ass before making him cum, Have fun! ;)"
  },
  {
    "id": 68,
    "title": "Spanking session -Time for a spanking session.Spank your sub 10 times with each of your whips. Have him count out loud every hit!And don’t forget his balls!",
    "content": "Spend extra time practising using your [flogger](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) technique. If you don’t have the technique down this is a great scene to practise!\n\nHere are some fun techniques for you to try!\n\nA.) The Carousel - Spinning the [floggers](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) in each hand fast enough so the tails fly out and will tickle the skin.\n\nB.) The Snap - Pull the tails of the [flogger](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) and us the like a slingshot!Pull them back and then release them!\n\nC.) Horizontal [Flogging](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) \\- Striking the body horizontally, usually across the bottom.\n\nD.) Figure of Eight - Use one [flogger](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) in a figure of eight motion across the bottom and up and down the back making impact with specific areas, double the heat by using two [floggers](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) and use one in each hand."
  },
  {
    "id": 69,
    "title": "Light Cock and ball torture - This sounds extreme but it really don’t have to! Here are a few ideas that you can do!",
    "content": "A.) Spank his balls with you whip\n\nB.) Spank his erect Penis.\n\nC.) While giving him a blowjob Bite his dick or balls.\n\nD.) Get a [Cock leash](https://www.lovehoney.eu/bondage/cock-ball-toys/ball-stretchers-dividers/p/dominix-deluxe-leather-ball-strap-with-lead/a35602g65086.html) and use instead of normal [Leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html)\n\nE.) Suck hard on his balls."
  },
  {
    "id": 70,
    "title": "Cream Pie - When he has been extra good or bad? Have him cum inside of you. When he is done have him clean it up with his mouth. Super hot and a great way to end a Scene!",
    "content": ""
  },
  {
    "id": 71,
    "title": "Almost there - This is a tease scene.",
    "content": "Tie your sub up really good. Tell him that he has been a good boy and deserves a reward. He is gonna get to fuck your pussy really really hard.\n\nNow make sure that your pussy is just just out of reach. Maybe let only the head of his dick in your pussy. Tease him like this for however long you want! Super hot!\n\n‘’What’s the matter baby? Stick it in ‘’Don’t you want to fuck my pussy?’’ ‘’Don’t make me disappointed…’’"
  },
  {
    "id": 72,
    "title": "Not Just For Me - Have your sub not pleased you enough but you still want to see cum? Get a [vibrator wand ](https://www.lovehoney.eu/search?q=wand&search-button=&lang=en_IE)use that against the head of his dick. He will Cum but it will be really hard for him which is super fun to watch! If you have a toy this can be great time to put that on his dick as well. The vibrator will vibrate the toy which will be an insane experience for him!",
    "content": ""
  },
  {
    "id": 73,
    "title": "Shuusshhh - I love [ball gags](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html). [ball gags](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) so often gets forgotten which is a shame. so here are some ideas.",
    "content": "A.) tell him that he has to be quiet if he doesn’t [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him and spank him! Or punish him another way!\n\nB.) Is he not respecting your dominance? For example saying things that he wants to do or you do to him? Like swallow my cum or I want to cum on your face. [Ball Gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him and punish him!\n\nC.) [Ball gag ](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html)him and then tell him to make you cum with the [ball gag.](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) If he cant, punish him!"
  },
  {
    "id": 74,
    "title": "Kiss and Tell - Tell him that you want him worship you with his words and kisses.",
    "content": "Give him 10 second or 20 second. Every second he must kiss you the next second he will give you a compliment. But the trick is he can never repeat the compliment!! This is super hard and I bet he won’t be able to do it. If he cant you can tell punish him. Love this one!\n\nAt the end you can say something like.\n\n‘’ I’m soo disappointed in you!’’\n\n‘’I thought you worshiped me.’’\n\n‘’But you can’t even come up with 10 compliments in 20 seconds’’"
  },
  {
    "id": 75,
    "title": "Hold on - This is a Classic but still fun.",
    "content": "Get a tray and a bottle with or without water. Ask him for how long he can hold the bottle on the tray with an extended arm. Right answer is obviously for as long as you want. You set a timer. Let’s say 5 minutes (could be 10 or an hour up to you). Now the fun begins.\n\nHe must hold the tray with the bottle on top with an extended arm for the full 5 minutes with out dropping it! You can jerk him off, spank him, kiss him or do whatever your want. If he fails punish him, if he makes it reward him!"
  },
  {
    "id": 76,
    "title": "Unleash yourself - A [Leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) is a great way to control you sub in play! It’s a great way to ‘’show’’ your sub what you want him to do. For example you want him to lick your pussy? Pull him close with the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html). Or if your are getting a massage and you want him to move up your body, pull on the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html). Want him to kiss your feet? Grab the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) and pull him down.",
    "content": "Honestly get a sexy [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) that you like and start using it. I always use a [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) in my sessions!\n\nHere a start to a scene that use a [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) as a main tool.\n\nHave him strip naked and place the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) on him.lead him to the bedroom, he should be crawling on all four.Grab the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) and pull him close to your face.\n\n‘’Are you gonna be a good bitch for me?’’\n\nhave him start kissing your shoes. When you are pleased Pull him up and make him start kissing your legs. When he starts to come close to your pussy, grab the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) so he just can’t reach it.\n\n‘’Do your deserve to taste my perfect pussy?’\n\n'’Beg for it!’’\n\nThen let him start to kiss your pussy.But just as he start to enjoy it pull him away.Make him say why he deserves to continue.Then have him give you an orgasm.\n\nYou see how much of a powerful tool the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) is? Super sexy and easy to use. :)"
  },
  {
    "id": 77,
    "title": "The plug - Tell your sub to send you a picture of him wearing his but plug at work!",
    "content": ""
  },
  {
    "id": 78,
    "title": "Pointers for Pointers -  This scene is super sweet!!",
    "content": "Tie your Sub to the bed or have him standing in front of a mirror with his hands bound behind his back,\n\nThen either get on top of him or behind him depending on the position and really slowly just point out all the parts of his body that you love and how lucky you are to have his loyalty and submission\\\\.\\\\\n\nI Love this especially right after an intense scene or just to show my love!!"
  },
  {
    "id": 79,
    "title": "The interrogator - Its time to get freaky! This one can get really wild! The interrogator is great if you want a real challenge.",
    "content": "The idea is simple. He’s is going to have a word in his head or code.Your job is to get that Code out of him!\n\nThere are 3 Rules.\n\nA.)He is not allowed to cum.And you can not make him cum.If he says he is close you have to stop whatever you’re doing.\n\nB.) If he cumes anyways he looses. He should have told you earlier.\n\nC.) You only have 1 hour. So make every minute count you ain’t got much time!!\n\nin order for this scene to work you need a really good price for the winner, and a really fun punishment for the loser. Make it nasty and sexy!\n\nHere are the prices we used last time!\n\nIf I win.\n\nhe will pay for a new toy a whip and lingerie set of my choosing.he will swallow his cum.he will not be allowed to cum for one week.When he is allowed to cum after a week it will be ruined!\n\nHe wins.\n\nHe get to cum in my mouth and i will swallow.He gets 10 free blowjobs that i will give him at anytime.I will buy a sexy lingerie set and surprise him.\n\nNow that you have your prices.\n\nHere is an idea of what I did last time we played this.\n\n(Warning we get freaky when we play this, we are both super competitive)\n\nI stripped him completely naked. I spanked him hard, I got a [remote controlled dildo](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) and I put it up his ass. Then I pulled his hair towards a chair. I Taped him into the chair using [BDSM tape](https://www.lovehoney.eu/bondage/handcuffs-restraints/bondage-rope-tape/p/lovehoney-black-bondage-tape/a71g71.html). Put a [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) on him then I told him to open his mouth, I leaned in and whispered in his ear ‘’ I’m gonna make you my bitch’’. Then right before I [ball gaged](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him I dripped just a little of my spit in his mouth.\n\nThen I walked out of the room. Occasionally I would turn on the vibrator with a remote. I put on my most Kinky Latex outfit on. Feeling powerful and sexy as fuck after about 10 minutes I came back and removed the gag. I talked to him while spanking him and asked for the code. I made sure that I was a real fucking bitch, I spanked him hard, slapped his face and dick, bit his ear dick, called him names all while asking for the code. I did this for about 10 - 20 minutes.\n\nThen I did a Complete switch! I started kissing him, telling him how cute he is. How much I just want this to be over, so he can fuck me hard.While sitting in his lap I whispered in his ear.‘’Just give the code honey and we can have some real fun ’’please don’t you want to fuck me?’’ ‘’Baby I need your dick inside of me’’\n\nI gave him a hand job, and even blowed his dick a little. Then I whispered in his ear again and slightly lifted the [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) so he just could see my outfit. ‘’All this can be yours..’’ Then I put the [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) back fully on.I could see that he wanted so so bad to give me the code.But my sub was stubborn and said no.\n\nWell I made sure to have a plan for this. I put the gag on and went back into bitch mode!I turned the dildo in his ass to max speed. And Started to Jerk him off until he was on the edge. When he said that he was going to cum. I took some frozen grapes in my hand and put them around his dick and balls.Then I placed them around is body.I continued to ask for the code but he said no.So I got a BDSM candle and started to pour wax on his body.When the wax got hard I went down on him and started to suck on his dick. When I saw that he enjoyed it I bit on his dick. And asked for the code.\n\nAfter that I took my whip and whipped the stale wax off his body. For every hit I did I asked for the code.I could tell that after the 30 - 40 minutes of play he was dying to give me the code. But he still said no.\n\nWhen all the wax was gone I asked him if he wanted to fuck me? And he said yes. I said ‘’But baby you’ve already made it clear that you don’t want to fuck me. So since you don’t want to fuck me, I’m gonna fuck you.’’ I pulled off the [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) and saw his eyes become wide open. I was standing right Infront of him with my [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) in my latex body.\n\nWell I think you can figure out what happened next.Bitch got the code! ;)\n\nBut I will say it’s not always that I’ve won. So if you’re gonna do this. You have to be in your A game! Prepare before you start otherwise your gonna be in for a tough time! Good luck!"
  },
  {
    "id": 80,
    "title": "Roll the dice - Get a dice and tell him that if he scores higher than you he gets to cum. If not he has to wait for the amount of days that he lost by! For example he gets a 2 and you get a 6. No cumming for 4 days!",
    "content": "If he do actually win he is allowed to cum but only after being edged the number of that he won by. So if he got a 6 and win he has to edge six times until he gets to cum."
  },
  {
    "id": 81,
    "title": "Instructor - Give instruction for how he should please you. The trick here is to be extremely picky! And very specific. Where should he touch, how hard should he touch, where should he lick, kiss and so on.",
    "content": "This is surprisingly hot, and a great way to get started with Femdom."
  },
  {
    "id": 82,
    "title": "Put it in writing! - Use a lipstick or a pen and write on your sub while you dominate him.",
    "content": "I like him to say each of our rules out loud.and while he does I write them on his body in lipstick."
  },
  {
    "id": 83,
    "title": "Double dildo - Have him put on a [dildo gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-large-silicone-ball-gag-with-dildo/a38375g70758.html). Then attach a suction cup dildo to the wall. He will be on all four with the dildo on the wall in his ass.",
    "content": "Now every time he pushes forward he fucks you with the dildo on his face. Every time he goes back the dildo on the wall fucks his ass!\n\nAwesome right!"
  },
  {
    "id": 84,
    "title": "Not yet - Do an entire session where you almost pull down his underwear but never do. Make sure that every time he think you gonna pull them down don’t!",
    "content": "Make him work for you to pull them down.make him earn it!\n\nIf he cant do it,  Jerk him off to orgasm without pulling down his underwear.And obviously ruin his orgasm."
  },
  {
    "id": 85,
    "title": "Did you think I forgot? - This is a starter idea, with a surprise twist for the sub.",
    "content": "Next time your sub does something bad. Don’t punish him right away. Wait until he forgets.\n\nWhen the time is right tell him you’re gonna give him a nice massage. Blindfold him and go and get your toys. Then come back oil him up all good and start massaging him.\n\nAfter while when he is completely relaxed. Lube up your [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html). whisper in his ear ‘’do you remember that thing you did? Well I didn’t punish you for that. Did you think I forgot?’'\n\nThe trick is to really ensure that he is not going to suspect anything.So really try to play it cool!"
  },
  {
    "id": 86,
    "title": "The Choice is yours - Bring out Six of your favourite whips.lay them out on the bed.next Take a Dildo and put it in your subs ass.",
    "content": "Get a dice and tell him roll twice.\n\nThe first roll: Determines how many times he will be punished.\n\nThe second roll: Determines how many strikes from the whip he will get each of the times he’ll be punished.\n\nBut whatever number he lands double it! So 1 = 2, 2 = 4, 3 = 6 and so on.\n\nNow let’s say he gets a 2 the first time and 4 the second time.He will be punished twice with 8 spanks each.\n\nNext choose if he rolls again or if you roll the dice.What ever the number it lands on use the corresponding whip.\n\nRemember If he at any point Drops the Dildo from his ass. He will get 10 spanks extra and gets another punishment. Raising it from 2 to 3 in the above example."
  },
  {
    "id": 87,
    "title": "I Want them sparkling - Get something that’s eatable but kind of hard to remove with just a tongue. Like honey or chocolate.",
    "content": "Now spread it on you and have him clean it up with only his tongue.easy!\n\nnow you can take this how ever far you want. Sometimes I like to put some on a some sexy high heels and have him slowly work himself up to my pussy.\n\nOr you can spread it on your ass and back and have him lick it all up!"
  },
  {
    "id": 88,
    "title": "Surprise, due mistress - This one is kind of similar to 85 but it’s not a punishment scene.",
    "content": "Start by lighting candles, put on some chill music and really set the mood for some love time. Instruct your sub to be fully naked and just put on [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE). Ensure that he follows your order before you continue.\n\nThen come into the room and start by giving your sub a nice massage with allot of oil.rub your tits on his back, kiss him and whisper stuff in his ear.\n\nwhen he is fully relaxed your gonna slowly start to enter him from behind with your [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html). But while you do this continue to massage him.\n\nNext take some frozen grapes and put them in your mouth. Start to kiss him while you continue to fuck and massage him.\n\nThis scene is soooo fuuucking hot. A Femdom massage!When you’re done you can just turn him around have a normal fuck if you want to! The scene is set to take it anywhere you want!\n\nSay something like ‘’now I’ve fucked you, now i want you to fuck me!’’ Super hot! Give this one a try!"
  },
  {
    "id": 89,
    "title": "A Devastating Blowjob - Here are some great tips for blowjobs that will make him desperate to cum!",
    "content": "A.) Kissing - Start by just kissing the tip of dick.then advance to use your lips to tease his dick.\n\n&#x200B;\n\n Open your lips slightly so that you can gently squeeze the tip of his penis between them.\n With saliva on your lips, gently run them over his penis.\n Use your lips to gently suck on the top of his penis.\n\nB.) The Twister – Using your tongue and lots of saliva, you can perform an ultra-pleasurable and satisfying blow job technique I like to call the Twister. While holding his penis steady in one.Make slow circular motion with your tongue around the top of his penis.\n\nAlternate direction and speed to add some variety, but this blissful bj technique alone is enough to bring him to a thundering climax.\n\nC.) Slip Inside - A less advanced BJ technique is as effective at providing him with intense stimulation as deep throating him.\n\nIs using the inside of your mouth. By taking him into your mouth and pressing/rubbing the tip of his penis against the inside of your cheek and tongue.\n\nBoom simple and you have another tool for your blow job arsenal.\n\nD.) Use The Roof – Carrying on from the previous technique, there’s another option for stimulating him: the roof of your mouth. If you think it cant help you when giving him a blow job, you’re wrong.\n\nThe texture feels great when you angle his penis so that the top of his glans moves against the ridges on the roof of your mouth."
  },
  {
    "id": 90,
    "title": "Stack em up! - So you want to give your sub a chance to cum. But how much time should he have to achieve an orgams? Tricky question… Well this scene is here to help.",
    "content": "Tie him up with his hand behind is back. Then take a spoon, an ice cream or a whip and place it in his mouth.\n\nNow get some dice, his job is to stack as many dice has he can on top of each other, on the tip of your whip!\n\nOnce he fails and all the dice fall to the floor do this:\n\nEach stack of dice give him 10 seconds.\n\nSo let say he stacked 4 dice on top of each other, he now has 40 second to cum!\n\nBoom your done, But wait there is more!\n\nIf you want to have some more fun you can say that the highest number that a dice rolled. When it fell to the floor.Thats the amount of times he has to edge before cuming.\n\nSo let’s say he stacks 4 dice, and the highest number of these 4 after falling where 2.\n\nThen he has 40 seconds to cum and has to edge twice before being allowed to cum! If he cant finish in time no cumming, game over!\n\nBut wait there is even more!\n\nIf you just can’t get enough of stacking dice on a whip.here is another game that also requires him to stack dice on a whip.\n\nHe is going to edge for you 10 times. But for each layer of dice he stacks he gets 1 edge discount.\n\nAnd when all the dice fall they must at least score 15 or higher. Otherwise he will not be allowed to cum!\n\nSo let’s say he stacks 5 dices and when they fell they added up to 17. Great!He has to edge 5 times (5 - 10 = 5). And since he scored over 15 he gets to cum!\n\nNow I’m done I promise…"
  },
  {
    "id": 91,
    "title": "Where do you want to cum - This one will help you with ending a scene.",
    "content": "Before you start ask him where he wants to cum.\n\nHe can chose:\n\nA.) Face / Mouth\n\nb.) Body / Tits\n\nc.) Ass\n\nd.) Pussy\n\nNow continue you scene. Depending on his answer different things will happen!\n\nA.) your face / Mouth: Tie him up and let him cum in your mouth, But slowly work your way up and push it into his mouth. Tell him to swallow it!b.) Body / TitsTell him that every time you snap your fingers he is to kiss, suck and worship your tits. Then continue with your scene. And from time to time snap your finger and have him worship your tits.\n\nThen by the end of the scene.Take some pillows and put them against the wall by your bed.(Sit against the wall like if you where sitting in a couch).Then have him straddle your [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) and ride you.His dick will now be right by your tits. Tell him to ride you hard while you jerk his dick.Have him cum on your tits.\n\nThen snap your finger……\n\nc.) Ass : Tie him up with his hands above his head in the bed.Then as you are [pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) him you will jerk his cock.Ask him if he wants to cum! Make him beg for it.Let him cum while you’re fucking him.\n\nd.) Pussy : Tie him up with his hands above his head.Then jerk him off or fuck him depending on how close he is.Just make sure that when he is just about to cum.Make him cum in or on your pussy.When he is done move your pussy up to his face and have him clean it all up.\n\nThe mix of his cum and your pussy juice will be amazing!"
  },
  {
    "id": 92,
    "title": "The Trick -  This scene will trick your sub into making a mistake so that you can punish him!",
    "content": "Tell him how you really want to cum from oral. Tell him you’re desperate for him lick your pussy the only way he can.\n\nHave him kneel. And stand Infront of him and tell him to put his tongue out. Now put your ass and pussy close to him but not close enough so that he can reach.\n\nTell him to pull down your panties. Ask him if he wants to kiss your ass. He will say yes. Give him permission to kiss it. As he start to kiss it grab his hair and really make him get make out with your asscheeks.Then you gonna really quick push his face towards your anal.\n\nRight after your gonna act super choked and say something like\n\n‘’Babe, did I give you permission lick my ass? Well now you can’t lick my pussy!!’’\n\nAnd now you can take the scene anywhere you want. You can punish him or you can tease him with your pussy. Cum right Infront of his face the sky is the limit!"
  },
  {
    "id": 93,
    "title": "Toys are Fun - For this a [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) or pocket pussy is a great tool!",
    "content": "You are going to tie him up spread across the bed like a star.Then you’re going to use him however you like.Ride him, make him eat you out and so on.\n\nIn the end have him cum right on his belly.But when he comes stop touching his dick so he ruins it.\n\nTell him that he has made such a mess and that you have to go clean up.\n\nGo away for 5 minutes and take shower, clean your pussy and so on.\n\nThen come back with a Dildo/[buttplug](https://www.lovehoney.eu/sex-toys/butt-plugs/jewelled-butt-plugs/p/lovehoney-jewelled-metal-beginners-butt-plug-2.5-inch/a40364g73767.html) and a [Fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) in your hand.And start play with his ass and dick until he gets hard again.\n\nJerk him off until he is just about to cum.Tell him that if he cums he must help you clean up.\n\nIf he says no. ruin his orgasm.leave the dildo inside of him and go away again for 5 minutes.\n\nThen repeat until he agrees to clean up. You can choose if cleaning up means with his mouth or just with some paper. But don’t tell him how he will clean it up, until he agrees to do it.\n\nThe fun part about this one is that he expect the scene to be over the first time you leave. And that he is tricked to think that he has to taste his cum even though that’s not the plan. ;)"
  },
  {
    "id": 94,
    "title": "Work it - Have him wear a [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) and tell him that he is going to make you cum. But he can only use the [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html).Then set a time of lets say 5 minutes. If he can do it awesome if he cant punish him.",
    "content": "Simple! I love this one!"
  },
  {
    "id": 95,
    "title": "I’m right behind you. - This one is suuuppeerr hot!",
    "content": "Have him stand up, and place a lubed [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) on the bed.Stand behind him and enter him with your [pegging kit.](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html)\n\nNow tell him to fuck the [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) on the bed.While he thrust he will also fuck his own ass.\n\nsince your standing right behind him and don’t have to do any work. Touch his body, kiss his neck and nibble his ear.whisper thing like:\n\n’’Fuck that tight little pussy for me’\n\n‘’do you want to finish inside of me?‘\n\n'’Fuck that pussy, show me you want it’’\n\nFrom time to time you can make him stop fucking the [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html).Grab his dick with one hand jerk him off, while you stand fuck him from behind!\n\nIts so hot to feel his body heat and sweat…I might actually do this one tonight again…"
  },
  {
    "id": 96,
    "title": "Riding your Face -  Tie Your sub up in a X fashion and put a dildo gag on him!",
    "content": "Then Start to ride his face. Your pussy juice and cum will flow down the gag into his mouth. Super hot!!"
  },
  {
    "id": 97,
    "title": "NAKD - Start your scene completely clothed and have him be naked.",
    "content": "Give him things to do like edging, begging, playing with his ass…\n\nWhen he does something that really pleases you.You will remove one thing.\n\nI like to do this while wearing something super sexy. This drives my sub even more crazy and he will do the most fun things just to see more!"
  },
  {
    "id": 98,
    "title": "Good boy - Next time you are doing your makeup and fixing your hair. Be it for going out or for a scene. Have your sub eat your ass out while you get fixed.",
    "content": "Put a [leash](mailto:https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) on him and pull the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) between your legs.Now tug on it hard and force his face into your ass! You have full control while getting ready.\n\nWhen you are done tell him to crawl behind you to the bedroom! Then start your scene. An added idea to this is to have a [remote controlled toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) in his ass while you’re getting ready. So you can play with him. While you’re doing your makeup."
  },
  {
    "id": 99,
    "title": "How do you want it? - Why should you always have to know what to do? Well in this scene you don’t.",
    "content": "Have your sub tell you how he should be dominated.it can be very submissive for a man to say that he wants you to pegg his ass, or to spank him, or force him to eat his cum.\n\nJust remember that whatever he comes up with, it should focus on your pleasure not only his!\n\nI also love to do this when I have an idea of what I want to do.But want him to guess it. Especially if it’s something like pegging where it might not be his first guess."
  },
  {
    "id": 100,
    "title": "The Pile driver - In this game you sub is going to be in the pile driver position (start by laying him on the floor, raise his legs up and over his head, now he is balancing on his shoulder with his dick right Infront of his face.)",
    "content": "Now you are going to play a jerk of game.\n\nYou have 5 minute to make him cum.if he win don’t cum he may cum where ever he wants.\n\nBut if he loses this position will make him cum on his own face!\n\nThat’s going to be quite the incentive not to lose!"
  },
  {
    "id": 101,
    "title": "Training - Don’t you just hate when you have to explain what position he should get into? Train him to remember different position and the commands.For example:",
    "content": "Kneel - on his knees hands on his legs\n\nAss - on his knees with hands on the floor and presenting his ass.\n\nDoggy - all four doggystyle\n\nHands - hands forward ready for cuffs\n\nSpread - standing spreader legs ready for leg spreaders.\n\n69 - lay flat on floor or bed\n\nHands back - hand behind his back ready for cuffs\n\nWall - hands against the wall legs spread\n\nFind the positions that you want to use and train him to learn them. Then have him complete a test if he fails punish him. Remember that all positions should be performed to perfection! Inspect with a whip at hand!"
  }
]