[
  {
    "id": 1,
    "title": "Don't drop it - let's start simple!",
    "content": "Sit in a chair in front of your sub, have him on his knees with his hands tied behind his back. Place a [remote control toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) in his rear end.\n\nAsk him to describe how sexy he finds you. Tell him you want to hear how much he worships you.\n\nThen remove your panties and hang them off his hard dick. Start masturbating.\n\nWhile you masturbate, he is going to continue saying how sexy he finds you.\n\nIf at any point he drops your panties or starts repeating himself, punish him.\n\nMaybe he will not be allowed to cum. Or maybe he will not be allowed to fuck you.",
    "tags": ["Power Play", "Orgasm Control", "Anal Focus", "Humiliation", "Punishment", "Bondage"]
  },
  {
    "id": 2,
    "title": "Ice, Ice Baby ",
    "content": "Place a steel or glass dildo in the fridge before play.\n\nThen tease him with it and tell him that it's going up his ass. Obviously, having it cold up there will not be very pleasant.\n\nSo tell him to suck on it to heat it up. However, he only has 10 seconds to do so.\n\nThis is always great fun watching your sub suck on the dildo as if there's no tomorrow.\n\nGreat as a punishment!",
    "tags": ["Impact & Sensation", "Anal Focus", "Oral Focus", "Teasing", "Punishment"]
  },
  {
    "id": 3,
    "title": "A lion in the bedroom - Time for some kinky sex.",
    "content": "In this scene, you will have sex normally but you will be in complete control.\n\nSpank his ass. Spit on his face. Bite his dick. Pull him into different positions by his hair. Call him names.\n\nWhen he cums ruin his orgasm!",
    "tags": ["Power Play", "Impact & Sensation", "Orgasm Control", "Humiliation", "Oral Focus"]
  },
  {
    "id": 4,
    "title": "Massage ",
    "content": "Tell him that he's about to prepare the best massage you've ever experienced and that you expect it to be at least 40 minutes long and that you want to be impressed.\n\nA good massage could include:\n\nFull body massage with oils, candles, soothing music, fruits, chocolates, relaxing scents\n\nWhen the massage is over, the scene is over. Everything does not have to be sexual.",
    "tags": ["Worship", "Power Play"]
  },
  {
    "id": 5,
    "title": "Who makes the rules here?",
    "content": "This is a \"Bitch scene.\" I came up with this one because my sub masturbated without asking me, and I became angry.\n\nStart by lying in bed and initiate normal sex as you usually do. Kiss his neck, touch his body - you know the usual routine. Work him up to think that you are just going to have normal sex.\n\nThen begin the conversation.\n\n\"Baby, have you been a good sub for me?\"\n\"Have you not been cheating and masturbating without my knowledge?\"\n\nWhen he admits to having masturbated, change tone immediately! Be angry and show him what he did is not okay!\n\n\"What!? Are you fucking kidding me!\"\n\"Get up and kneel!\"\n\nForce him out of bed and have him kneel in front of you.\n\n\"Stay here and don't move!\"\n\nGo to your toy box and get a whip, lube, [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) and a [chastity cage.](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) If you want to dress sexy do, take your time. He most definitely can wait.\n\nWhen you’re done come back tell him to close his eyes. Stand in front of him and ask.\n\n\"What are our rules?\"\n\"Is there something that you don't understand about our rules?\"\n\"And what happens when you don't follow the rules?\"\n\"That's right baby, I will decide a punishment and punish you.\"\n\nHold the [pegging kit ](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) in one hand, the [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) in the other. Tell him to open his eyes.\n\n\"Now baby, what should I do? I could peg you and then ruin your orgasm. Or I can put you in chastity for a week and make you beg to cum?\"\n\nLook at him like you want an answer. Even if he doesn't give an indication of what is the best, pretend that you heard him say something.\n\n\"The nerves you have... did I ask for your opinion?\"\n\nSince he can’t keep his mouth shut when he should, you will do both!\n\nStart by pegging him. And while you're doing it, make him repeat the rules to prove that he knows them!\n\nThen spank him 30 times with your whip. Have him count every hit out loud.\n\nThen have him make you cum in any way you want. with his mouth, fingers, dick - anyway you want.\n\nAfter that you are done, place him in chastity for the week! He will definitely learn his lesson after this!",
    "tags": ["Power Play", "Punishment", "Anal Focus", "Chastity", "Impact & Sensation", "Orgasm Control"]
  },
  {
    "id": 6,
    "title": "The Coin Flip",
    "content": "A perfect ending Scene! Make sure your sub edges for you at least 10-15 times in a row.\n\nThen bring out a coin:\nHeads he gets to cum, Tails stop immediately. Better luck next time honey.\n\nThis is a lot of fun if he has been in chastity before the scene.\nIf he loses, place him back in chastity. And have him try his luck again the next day.\nIf you want to, you can extend the chastity by blindfolding him. Then simply lie about the result of the coin flip.",
    "tags": ["Power Play", "Orgasm Control", "Chastity", "Teasing"]
  },
  {
    "id": 7,
    "title": "Stay Down - This is a Body Worship Scene.",
    "content": "Sit in a chair or on the side of the bed. Have him on his knees worshipping your feet with massage and kisses, but don't let him progress up onto your legs. Instead, make him stay there and beg to kiss your legs!\n\nThen, when you see fit, ask him:\n\n\"Who do you worship?\" \n\"Repeat our rules.\"\n \"Are you my bitch?\"\n\nThen let him progress to massaging your legs.\n\nThis scene is great as the start to your session or simply if you want a foot rub with a feminine domination (femdom) twist. To spice it up, consider placing a toy in his ass and playing with him while you enjoy your foot massage.\n\nAlternatively, use this as punishment. Tell him he has not earned the right to kiss you or your body. He has not even earned the right to kiss your anus.",
    "tags": ["Worship", "Power Play", "Anal Focus", "Punishment", "Teasing"]
  },
  {
    "id": 8,
    "title": "The Surprise Ending",
    "content": "Have sex as you likely have numerous times before, and perform your usual routines. Avoid any Dominant behavior and simply continue with your typical actions.\n\nBut when he cums, surprise him by having him clean you with his mouth. It works best if he has no idea it's coming (pun intended).\n\nRemind him of your rules and tell him that you expect him to follow them. Do not let him escape the consequences.",
    "tags": ["Power Play", "Oral Focus", "Humiliation", "Teasing"]
  },
  {
    "id": 9,
    "title": "Wax play",
    "content": "Super fun and really sexy! You can use normal candles, but for safety purposes, I recommend using BDSM or massage candles instead. These types of candles have a low melting point, but they still provide a sting.\n\nBelow is a punishment scene, which is one of my favorites for play!\n\nGet a candle and have him lay flat on his stomach. Place the candle in his ass.\n\nWhisper in his ear, \"Do you like fire?\" Then light the candle!\n\nTake a step back and simply admire how sexy this is!!! A candle protruding from his ass, with the flame atop! Oh my god!\n\nWhile the candle is burning, take your whip and run it over his body. Over his back, over his arm, over his ass... wait until you see the candle start to melt.\n\nWhile you wait, ask him, \"Are you going to be a good slave for me?\" Squat in front of his face. \"You see this pussy? This pussy deserves to be worshipped.\" \"How much do you want to worship my pussy?\"\n\nLift his head up and stare him directly in the eyes. Place your whip in his mouth and instruct him not to drop it.\n\nThen remove the candle from his ass. And pour the remaining wax all over his body.\n\nDrip it on his ass and back. Take your time and drip it slowly. Try writing your name on his back with the dripping wax.\n\nWait for the wax to harden. Then retrieve your whip from his mouth.\n\nAsk him if he is ready for his punishment.\n\nThen whip the wax off his body. When every bit of wax is gone, you are done!\n\nAfter this, continue your scene however you wish.",
    "tags": ["Impact & Sensation", "Anal Focus", "Punishment", "Worship", "Oral Focus", "Teasing"]
  },
  {
    "id": 10,
    "title": "A devastating Handjob",
    "content": "A great hand job scene is perfect when you don't want sex. To make the hand jobs a little more fun, here are some great techniques to use!\n\nA.) Over the top : Start by stroking him up and down with your hand as you normally would. While doing so, rub your thumb over the back of the head of his dick.\n\nSo your hand is stroking him normally while your thumb is focusing only on pleasuring the top of his dick. Simple.\n\nThis is the most sensitive spot on his dick. Watch him squirm with pleasure.\n\nB.) Over the top double handed : Same as before, one hand will jerk him normally but the other hand focuses on the head of his dick.\n\nGet creative with the hand pleasuring his dick head. For example, with fingers loose, run the tips of them over the head and then back again. Use the tip of one finger to make small circles around the tip of his dick.\n\nC.) The Escalator - Use a lot of lube for this one. To start, take your right hand and stroke him from top to bottom. When you reach the bottom, let go of his dick and do the same movement with your left hand. Start from the top and go to bottom then remove your hand.\n\nNow continue doing this, left, right, left, right. He will experience a never-ending sensation!\n\nD.) The Twist : Lube again! Grab the bottom part of his dick with one hand and grab the top part of his dick with your other hand so that both hands are holding it. Don’t worry if your bottom hand is holding most of his dick and your second hand doesn’t have much to hold.\n\nWithout applying much pressure, rotate one hand in a clockwise direction around his dick while rotating your other hand in an anti-clockwise direction. When you can’t turn your hand any more, change direction and rotate each hand as far as possible in the opposite direction.\n\nThis sounds like quite a slow process, but it is much more pleasurable the faster you do it.\n\nE.) The Ring : This is super simple. You just need to make an ‘O’ shape by touching the tip of your index finger to your thumb. Then instead of wrapping your whole hand around your man’s shaft, use only the ‘O’ and then stroke him up and down with it. Make him beg for you to use your entire hand!\n\nF.) Palming - Rub the palm of your hand over his head. Do it slow and fast. This is great as post-orgasm torture.\n\nG.) Milking & Sucking - An awesome way to suck your man’s balls while giving him a hand job. Have him on all fours and stand behind him. Pull his dick down so it faces the floor and jerk him off. In this position, his balls will also be exposed, so it’s perfect for sucking him. Take his balls in your mouth while using your hand to jerk him off. His ass is also totally exposed for you to play with! Get a dildo or [buttplug](https://www.lovehoney.eu/sex-toys/butt-plugs/jewelled-butt-plugs/p/lovehoney-jewelled-metal-beginners-butt-plug-2.5-inch/a40364g73767.html) and go wild!\n\nP.s Remember Lube makes all these more fun and take it slooooowwwwww. The longer you take, the more desperate he will become.",
    "tags": ["Orgasm Control", "Oral Focus", "Anal Focus", "Teasing"]
  },
  {
    "id": 11,
    "title": "Jerk Off Instructions (JOI)",
    "content": "Give him instructions on how to jerk off. Instruct him when to begin, how quickly to move, when to pause, how deeply to stroke, and so forth. Enjoy the performance or carry out the instructions over the phone.\n\nIf you want to assert your dominance have him taste or swallow his cum when he’s finished.\n\nThis is an entire category of porn so you can get some tips from JOI videos online.",
    "tags": ["Power Play", "Orgasm Control", "Humiliation", "Oral Focus"]
  },
  {
    "id": 12,
    "title": "Up all night to get lucky - A fun dice game.",
    "content": "Roll a die. The sub does not get to see what the score is. The score determines the result of the evening for the sub.\n\nIf you score 1 - Bad luck for him. After you orgasm, all play stops. No pleasure for him.\n\n2, 3 or 4 - Get him to the edge. When he’s about to cum, he must beg you to stop. The score he got determines how many times he will edge before play stops. No cumming for him.\n\n5 - After 4 edges, continue but instead of a fifth edge, bring him to orgasm - But ruin it.\n\n6 - After 5 edges, continue but instead of a sixth edge, give him a full orgasm.",
    "tags": ["Power Play", "Orgasm Control", "Roleplay"]
  },
  {
    "id": 13,
    "title": "Goddess Day",
    "content": "Make an entire scene about you and explore more of worshiping.\n\nHere are some examples of things he can do for you:\n\nRun a bath tub and bring chocolates and strawberries. \nMassage your entire body, from head to toes.\nPaint your toenails. \nCook your favorite dinner.\nBring you to an orgasm without expecting any return favor.",
    "tags": ["Worship", "Power Play", "Roleplay"]
  },
  {
    "id": 14,
    "title": "Edging",
    "content": "Tonight will be focused on stamina and willpower. Before he is allowed to cum have him edge at least 15 times!\n\nEach time he edges he must say why he deserves to cum, how much he worships you, and what he would do if he was allowed to cum.\n\nAnd remember this is still all about you. So naturally, he can't expect to achieve cum until he has met every one of your needs.\n\nDon’t tell him in advance how many times he must edge for you. And before granting him that sweet release, make him beg for it!\n\nA fun thing to do is to play with his responses as he grows increasingly desperate to climax.\n\nHe might say \"I'll do anything if you let me cum!\"\n\nAnswer him \"Like what?\"\n\nSee what he says. Make him carry out whatever he proposes you. ;)",
    "tags": ["Orgasm Control", "Power Play", "Worship", "Teasing"]
  },
  {
    "id": 15,
    "title": "Rimming",
    "content": "Something I love is a good rim job. I love to receive a rim job immediately after I step out of the shower. I switch on my favorite series on Netflix or catch up on my text messages while he simply massages my ass with his tongue.\n\nHere are a few Ass worship positions to try out:\n\nA.) The ‘Sandwich’: Start by lying on your stomach with your ass facing upward. Your sub will now eat you out while you watch your phone or just relax. Don’t forget to grab you subs hair push him into your ass to show him who is in charge.\n\nB.) Back to the Wall: Your sub is going to sit on the floor with their back against a wall. You stand in front of him and tease him with your ass. This position is excellent if he has his hands tied behind his back. It's also great as a tease for a scene starter. Tell him to stick out his tongue for you! And then tease him.\n\nC.) The Chair: Another way of enjoying Ass worship is for you to sit on a chair with your ass hanging off the side. Then have your sub get on his knees behind you and eat you out.",
    "tags": ["Worship", "Oral Focus", "Power Play", "Teasing"]
  },
  {
    "id": 16,
    "title": "Pinhead",
    "content": "If you do not have a [Pinwheel](https://www.lovehoney.eu/bondage/electro-medical-fetish/pain-sensation-play/p/fifty-shades-darker-adrenaline-spikes-metal-wartenberg-pinwheel/a35197g63954.html) yet, you should definitely consider getting one!\n\nTie him to a chair with his hands behind his back, blindfold and ball gag him.Then start to roll the pinwheel over his body.\n\nGo harder and softer all over his body.\n\n‘’Are you going to be a good boy for me?’’\n\nStart to roll the pinwheel over his dick head. Use different amount of pressure on his dick.\n\nNow you are going to alternate teasing his dick with your mouth and rolling the pinwheel all over his dick.\n\nSee how long he will last until he begs you to stop.\n\nPlace the pinwheel in the fridge before you start to play. The cold will make it seem much sharper than it actually is.\n\nYou can do this with a steel butter knife to make it seem like a super sharp object too.",
    "tags": ["Impact & Sensation", "Bondage", "Oral Focus", "Teasing", "Power Play"]
  },
  {
    "id": 17,
    "title": "Make them Shine! ",
    "content": "Another Dom worship scene! For this scene you need some knee high boots or high heels!\n\nSit in front of your sub and ask him if he thinks he can lick you to an orgasm? Well you don’t think so..why don’t he prove it!\n\nTell him to lick your boots, and make them shiny. While he is doing this you’re in perfect position to spank his ass with a whip. Or to masturbate in front of him. Tell him to hurry up and impress you. Otherwise you will cum and he will not be allowed to taste you!\n\nThis can also be a perfect opportunity to lay out the rules for your scene.\n\nIf he even comes near to kiss your leg. Spank him hard and tell him he has not earned to kiss your legs yet!\n\nWhen you are satisfied with the job.\n\nPut your legs on his shoulders and push him towards your pussy.and have him lick you to an orgasm. Then continue your scene with whatever your want.\n\nBONUS: When you are done with your scene give him an option.\n\nHe is allowed to cum. BUT only on you shoes. And he has to lick them clean. And you want them fucking shining!\n\nSee what he chooses. ;)",
    "tags": ["Worship", "Humiliation", "Impact & Sensation", "Oral Focus", "Power Play", "Orgasm Control"]
  },
  {
    "id": 18,
    "title": "When I’m back ",
    "content": "Go run an errand or have a girls night out but tell your sub that when you come back you want him to be:\n- Shaved\n- Naked\n- Wearing your favorite [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html)\n\nAnd on his knees with a large butt plug in his ass and your preferred whip in his hands, he should be waiting for you at the door.\n\nDon't tell him when exactly you will return. This will keep him attentive upon your arrival home.\n\nUpon your return, inspect your submissive and then commence your scene.\n\nAlternatively, you can inspect your submissive upon arrival. However, refrain from starting a scene! Just say \"Good job, now get dressed.\"",
    "tags": ["Power Play", "Bondage", "Anal Focus", "Roleplay", "Teasing", "Humiliation"]
  },
  {
    "id": 19,
    "title": "Hurry up!",
    "content": "Have him perform a task for you like oral, a massage or a rim job. When you are satisfied tell him he is going to be rewarded.\n\nSet a timer for maybe 3 minutes. In this time he has to cum, you can make it as hard or as easy as you like.\n\nWant to make it hard? He is not permitted to touch his dick with his hand.\n\nWant to have some fun? Place a [Fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) on the floor and watch him struggle to get his dick inside it as it slides around on the floor!\n\nSpank him while he is trying to cum!\n\nIf he fails, tell him you’re disappointed and that you wanted to see him cum. Ask him if he is sorry and then punish him with 30 spanks.\n\nWhile you spank him, play with his dick and have him explain why he deserves to cum.",
    "tags": ["Power Play", "Orgasm Control", "Impact & Sensation", "Punishment", "Humiliation", "Oral Focus"]
  },
  {
    "id": 20,
    "title": "Double penetration",
    "content": "This is one of my absolute favorites. For this, I recommend getting a [Dildo with a suction cup.](https://www.lovehoney.eu/search?q=suction+cup+dildo&search-button=&lang=en_IE)\n\nTell him he is going to earn to fuck you. Then place a dildo on the floor and tie his hands behind his back. Have him ride the Dildo. While he is riding the dildo he is going to perform oral on you. if he ever looses pace or he cant please you to your standards spank him with your whip.\n\nNow turn up the heat even more! When you are satisfied untie his hands and tell him to lean back While keeping the dildo in his ass. His hands should be touching the floor.\n\nThen start to ride him, and ride him hard, fuck his brains out. Every time you bounce he will ride the Dildo. Double Penetration Femdom Style!\n\nThis is so so hot I love this one.",
    "tags": ["Anal Focus", "Oral Focus", "Power Play", "Bondage", "Impact & Sensation"]
  },
  {
    "id": 21,
    "title": "Set the Scene ",
    "content": "Have him set the scene. Provide him with instructions on what you'll need for the scene and how you want it arranged. [Bed restrains](https://www.lovehoney.com/search?q=bed+restraints&search-button=&lang=en_US), [dildos](https://www.lovehoney.com/search?q=dildos&search-button=&lang=en_US), [buttplugs](https://www.lovehoney.eu/sex-toys/butt-plugs/jewelled-butt-plugs/p/lovehoney-jewelled-metal-beginners-butt-plug-2.5-inch/a40364g73767.html) - name them as required.\n\nObviously, don't disclose what you will actually do. You should also have him arrange items that you won't actually use. For example, have him arrange the largest dildo you own, or that one whip he doesn't prefer. Have him arrange an item like this.[ pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html). Who said anything about using it right away?",
    "tags": ["Power Play", "Roleplay", "Teasing", "Worship"]
  },
  {
    "id": 22,
    "title": "Ruined Orgasm",
    "content": "Another technique that I love! Can be used alone or in conjunction with edging. At the moment he cums, stop touching him completely. Don't let him touch it any more either. Just let his orgasm happen with no extra help.\n\nThis is also an excellent compromise. I love seeing cum squirt from my BF's dick. However, what if he hasn't earned a full orgasm? Why should I suffer for that? Ruin his orgasm, and you get to enjoy a show; he will try even harder next time you play!\n\nThe great thing about this technique is that you can make him come several times. Just wait 10-15 seconds and start again.",
    "tags": ["Orgasm Control"]
  },
  {
    "id": 23,
    "title": "Every day, I'm bossing him",
    "content": "Get a [remote controlled toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) and place it in his ass.\n\nNow, whenever you need something, give him a buzz.\n\nWant a cup of coffee? - buzz\n\nWant lunch? - buzz\n\nNeed some attention? - buzz\n\nGreat idea! Why did I think of it now!",
    "tags": ["Power Play", "Anal Focus", "Teasing", "Worship"]
  },
  {
    "id": 24,
    "title": "How many times can you cum?",
    "content": "Tie him up and see how many times he bears to cum before begging you to stop. Remember you must always ruin his orgasm so he can continue. And remember to wait maybe 10 -15 second before you start jerking him off again. The last time you make him cum give him a full orgasm and enjoy the show or cum flying everywhere!\n\nMy personal record is six cumshots. Can you beat that? :)",
    "tags": ["Orgasm Control", "Bondage", "Power Play"]
  },
  {
    "id": 25,
    "title": "The Adventure ",
    "content": "In this game your sub will have to answer questions that he have not heard. He can only answer ‘’Yes’’ or ‘’No’’. Depending on his answer your scene will look different.\n\nStart by just having him say Yes or no and then have fun.\n\na.) I will give Miss a full massage\n\nb.) I will wear a butt plug for the entire scene\n\nc.) I will give miss Oral\n\nd.)I will not be allowed to look miss in the eyes\n\ne.) Miss will allow me to fuck her\n\nf.) Miss will use a dildo in my ass\n\ng.) Miss will Spank me 25 times\n\nh.) I will be tied up\n\nI.) I will be wearing a ball gag\n\nJ.) I will only be allowed to ruin my orgasm\n\nYou can make your own questions but this is a start.",
    "tags": ["Power Play", "Roleplay", "Orgasm Control", "Anal Focus", "Impact & Sensation", "Bondage", "Oral Focus"]
  },
  {
    "id": 26,
    "title": "Rimshot",
    "content": "Have him ejaculate on your ass and then have him lick it up.\nYou can use this as a setup while you’re in a scene!\n\n  \"'Do you want to come, baby?'\"\n  \"'But you don't deserve to come.'\"\n  \"'I'll let you come, but you have to clean it up with your mouth, okay'\"\n\n  When he says yes.\n\n  \"'Good! Come on my ass, and lick up.'\"\n\n  Just before he is about to cum tell him to ruin it!\n\n  \"'Ruin your orgasm!'\"\n\nSuper sexy and super kinky!",
    "tags": ["Oral Focus", "Humiliation", "Orgasm Control", "Power Play", "Worship"]
  },
  {
    "id": 27,
    "title": "Put on a show for me ",
    "content": "This is a power scene. Start by pouring yourself a glass of champagne or wine. Then, place some toys on the floor.\n\nIt can be anything, for example, a [Dildo](https://www.lovehoney.eu/search?q=suction+cup+dildo&search-button=&lang=en_IE), [Fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html), a [dick pump](https://www.lovehoney.eu/sex-toys/dick-extenders-enlargers/dick-pumps/p/tracey-cox-edge-ultimate-performance-stamina-dick-pump/a28656g46571.html) and lube.\n\nYou can also place non-sexual items like panties, fruit, chocolate, or whipped cream.\n\nTell him that you want to be entertained, and if he does a good job, he will be rewarded.\n\nThen set a timer and enjoy the spectacle. Don't hesitate to issue commands like:\n\nThe key here is to really enjoy yourself. Play music, give orders, take the bottle of champagne and pour it into his mouth.\n\nCommands can be things such as \"Fuck your ass faster!\" Or \"Pump it more! I want to see you cum explode!\"\n\nSit back with a whip and just enjoy the spectacle. I always get such a power rush from this.\n\nEnjoy the spectacle!",
    "tags": ["Power Play", "Humiliation", "Roleplay", "Teasing", "Orgasm Control"]
  },
  {
    "id": 28,
    "title": "You're not worthy ",
    "content": "Has he not earned your wonderful pussy? Or perhaps he has, but you don't feel like having sex?\n\nThe great thing about [Fleshlights](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) is that they are much easier to use for teasing than you might think. You can tease him with just the tip of his dick before pushing it all the way in.\n\nTie him up and torment him, tease him intensely. Use them in the manner described. [Fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html). Make him beg for you to use the full Fleshlight!\n\nBonus: don’t forget that these are great for post-orgasm torture as well!",
    "tags": ["Orgasm Control", "Teasing", "Humiliation", "Bondage", "Power Play"]
  },
  {
    "id": 29,
    "title": "Question Time - How well does your sub know you? ",
    "content": "Create a quiz with questions about you and your desires. If he really worships his goddess he should know everything about her right?\n\nFor every incorrect answer, spank him or deny his orgasm, or for every answer he gets wrong, no orgasm for that number of days. \n\nA fun twist to this is not telling him the correct or incorrect answers; instead, inform him only of the total score, such as 11/20. This will encourage him to study everything about you without knowing where to start, keeping him constantly interested in your conversations.",
    "tags": ["Power Play", "Punishment", "Worship", "Orgasm Control", "Roleplay"]
  },
  {
    "id": 30,
    "title": "Be careful what you wish for",
    "content": "Be careful what you wish for - Post orgasm torture is when you just continue to fuck, jerk or blow a dick that already has cummed. This result in overstimulation which is described as a very strong tickeling feeling and eventually another orgasm.\n\nWhen your sub pleads with you to allow him to cum, continue to jerk him off after he has done so. He will find it difficult to restrain himself from overstimulation.\n\nWhisper in his ear, \"I thought you wanted to cum.\" So, so HOT!",
    "tags": ["Orgasm Control", "Impact & Sensation", "Teasing", "Power Play"]
  },
  {
    "id": 31,
    "title": "Your body is a wonderland",
    "content": "Set a timer and promise him that if he can worship your body to your satisfaction before the time ends, you will reward him. He can satisfy you in any way he likes, but he can not touch your pussy. If you think he does a good enough job, reward him; otherwise, do not.\n\nRemember, however, that a reward can be both small and large! Some might consider unlimited access to one's body as a reward in itself. So you can give him a kiss and call that a reward, and next time you could give him oral sex. This approach will ensure he always does his best and never knows what to expect.",
    "tags": ["Worship", "Power Play", "Teasing", "Orgasm Control"]
  },
  {
    "id": 32,
    "title": "Close the gap",
    "content": "This one is designed to help you with a sub who masturbates too much or has been allowed to cum more than you.\n\nTell him that he will not be permitted to cum until he has made you orgasm x amount of times.\n\nYou can set a high number that spans several sessions, or you can set a low number that might be achievable but only if he concentrates.\n\nI usually say 3 - 4 orgasms reward him with 1.\n\nIf your sub is masturbating and has not been following the rules, place a [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) on his dick. Only allow him to remove it when he has learned not to cum without your permission.",
    "tags": ["Power Play", "Orgasm Control", "Chastity"]
  },
  {
    "id": 33,
    "title": "Snowball",
    "content": "Deny your sub's orgasm for an entire week. Then tie him up and reward him with a nice blowjob, or if you want to make him do the work, simply catch it with your mouth as he jerks off. \n\nThen slowly, very slowly, work your way up his body and give him a big kiss. The longer it takes you to touch his lips, the more his libido will have subsided. Once your lips connect, push his cum into his mouth. Let him feel the amount of the seed he has been saving for the entire week.\n\nWhen it’s in his mouth look him deep in his eyes and say.\n\n‘’Be a good bitch for me and swallow it baby.’’",
    "tags": ["Oral Focus", "Humiliation", "Orgasm Control", "Bondage", "Power Play"]
  },
  {
    "id": 34,
    "title": "Oral - Tell him that he's going to make you cum from oral tonight. But you want an experience!",
    "content": "He is to make you cum with his mouth in a new and unique way. He should impress you with his new skills!\n\nBefore tonight he should have studied new techniques and positions. And be prepared to take you to heaven.\n\nIf he cant impress, he will be punished!",
    "tags": ["Oral Focus", "Power Play", "Punishment", "Worship"]
  },
  {
    "id": 35,
    "title": "The Blowjob - Has your sub been super good and you want to reward him. This scene is for you!",
    "content": "Start by tying him up to a chair. Make sure that it’s really tight so that he can’t move. I recommend using [BDSM Tape](https://www.lovehoney.eu/bondage/handcuffs-restraints/bondage-rope-tape/p/lovehoney-black-bondage-tape/a71g71.html) since it makes this much easier and faster.\n\n[Blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE) him and start to tease him. Walk around the chair so he don’t know exactly where you are.\n\nWhisper into his ear and touch him from behind. Tease your way to his dick. Take your time.\n\nThen, when he can no longer endure the wait, initiate a devastating blowjob!\n\nReally a hot scene and adds a bit of Femdom into a blowjob!\n\nBonus: Take a sip of champagne or sparkling candy before you suck his dick, the bubbles with give a crazy sensation for him.",
    "tags": ["Oral Focus", "Bondage", "Teasing", "Power Play"]
  },
  {
    "id": 36,
    "title": "Hug the wall ",
    "content": "Have him hold a penny against a wall with his nose and fingers. He will hold one penny with each finger and one with his nose.\n\nYou can use this position while you spank him. Tell him that for every penny he drops, add ten more spanks.\n\nP.s If you have a [Cock leash](https://www.lovehoney.eu/bondage/cock-ball-toys/ball-stretchers-dividers/p/dominix-deluxe-leather-ball-strap-with-lead/a35602g65086.html), you can pull on it as you make your last hit! That will lead him to drop all of the pennies.\n\nI know I'm a bitch. ;)",
    "tags": ["Impact & Sensation", "Punishment", "Power Play", "Bondage", "Humiliation"]
  },
  {
    "id": 37,
    "title": "Locked Away - This is a Chastity Idea That Can Last for However Long You Want. ",
    "content": "Place your sub in a [chastity cage ](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE), but lock him up with a combination lock.\n\nNow make him earn each digit one by one!\n\nThis process can last as long as you desire. For example, if it's a 4-digit lock, establish a system where, if he behaves well every week, he receives one digit every week for a month.",
    "tags": ["Chastity", "Orgasm Control", "Power Play", "Roleplay"]
  },
  {
    "id": 38,
    "title": "Let's go!",
    "content": "This is a setup scene, which can assist you in initiating play. Prepare the scene you wish to enact. However, ensure your sub is unaware that you are planning anything.\n\nThen get a [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) and sneak up behind him. From behind, place the [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) in his mouth and whisper for him to kneel but not look at you.\n\nTell him to strip naked, then place a [collar and a leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) on him. Instruct him that he will crawl to the bedroom.\n\nWhen he enters the room, kick the door shut and start your scene.",
    "tags": ["Power Play", "Bondage", "Roleplay", "Teasing", "Humiliation"]
  },
  {
    "id": 39,
    "title": "The O Race - Challenge your sub to a Masturbation Race.",
    "content": "You can, of course, cheat. For example, warm up before initiating the race so that you are already quite close even before you start. Or simply fake your orgasm. If he asked how you could cum so quickly, tell him that this is your favorite vibrator for a reason. ;)\n\nSpice it up with a punishment for losing. Here are some ideas:\n\n* No orgasms for 5 days. He gets to orgasm but he must ruin it and swallow it.\n* Spanking\n* Massage and body worship for you.\n* [Pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) (Website for BDSM toys or accessories)",
    "tags": ["Power Play", "Orgasm Control", "Punishment", "Roleplay", "Impact & Sensation", "Anal Focus", "Worship"]
  },
  {
    "id": 40,
    "title": "Locktober and No Nut November",
    "content": "If you want to see how far you can take the no cumming idea, try the challenge of a month of play but no cumming! \nFor him, that is. Locktober is as the name suggests about Chastity. But if you’re not into that, November might be more your thing.\n\nThe purpose of these months is that nothing should change for you. If you wish to engage in sexual activity, feel free to do so. If you wish to stimulate his genitalia, go ahead, and if you desire to achieve orgasm from oral sex, that's also an option. Just remember, no ejaculation on his part.\n\nTo be honest, this is as difficult for me as it is for him. Something I like to remind him of after 24 days of teasing. And by the way, you can perform these acts in July or March as well. This way, he will have had some practice before Locktober or No Nut November.",
    "tags": ["Chastity", "Orgasm Control", "Power Play", "Roleplay"]
  },
  {
    "id": 41,
    "title": "Have a full scene where you do not touch his dick. There are plenty of things that do not involve his dick.",
    "content": "Remember that Femdom is all about you! There are several things you can do that don't involve his dick:\n\nOral sex\nHaving him penetrate you with a strap-on\nMassage for you\nPegging\nSpanking\nTeasing",
    "tags": ["Power Play", "Worship", "Oral Focus", "Anal Focus", "Impact & Sensation", "Teasing"]
  },
  {
    "id": 42,
    "title": "The most evil Scene ever ",
    "content": "So, your sub is in chastity, and you wish to be a bitch? In that case, this is indeed your scene!\n\nIn the morning, whisper in his ear \"I want your cock and hot cum in my mouth tonight.\"\n\nHe will become extremely excited about being allowed to climax.\n\nWhen the night arrives and it's time for his blowjob, begin to tease him with your mouth and use dirty talk. Then start to suck his dick, but do not remove the chastity cage.\n\nIf he is able to cum from this experience, it will be great. However, if he cannot, express your disappointment by saying, 'I wanted your hot cum.' And continue to rub your pussy on his chastity cage, moving it all over as you speak of how much you desire his dick.\n\nAfterward, begin to rub your pussy with your hands.\n\nWhen you are close to climaxing, say \"Baby, I wanted us to cum together!\"",
    "tags": ["Chastity", "Orgasm Control", "Teasing", "Humiliation", "Oral Focus", "Power Play"]
  },
  {
    "id": 43,
    "title": "Focus!",
    "content": "Get into a 69 position and let him pleasure you with whatever you prefer, such as oral sex, toys, or fingers. You are in charge.\n\nWhile performing this, gradually give him a blow job. Begin extremely slow, perhaps just breathing near it. Or have it in your mouth without actively sucking, but with time, intensify.\n\nIf at any point the quality of the pleasure you receive decreases:\n\nStop blowing him and tell him that he clearly can’t handle your amazing blowjob. So you will stop so he can focus better on you.\n\nOnly when you feel like giving him more start again but when you do, start again agonizingly sloooww.",
    "tags": ["Oral Focus", "Power Play", "Orgasm Control", "Teasing"]
  },
  {
    "id": 44,
    "title": "A Week of Femdom",
    "content": "Most couples are actually switches, which means sometimes you Dom and sometimes he does. It's quite rare for people to have a 24/7 femdom sex life.\n\nTry it out! Have a week of Femdom. You don't need to have sex every day. There are many non-sexual scenes. For instance, have him treat you to a Spa night at home, or have him prepare a five-star dinner complete with a menu for you. The sky is the limit.\n\nHowever, make sure that he knows who's the boss this week!",
    "tags": ["Power Play", "Roleplay", "Worship"]
  },
  {
    "id": 45,
    "title": "Make it happen",
    "content": "Tell your sub that he can cum but only if he can do it without using his hand, if he fails no cumming this session.\n\nDon't forget to set the timer.\n\nYou can decide if sex with you is an option. If it is, don't tell him. See if he can figure that out. Then, when he fails to climax, tease him and ask why he didn't attempt to fuck your sweet sweet pussy. That was a missed opportunity that rarely comes. ;)",
    "tags": ["Orgasm Control", "Power Play", "Teasing", "Humiliation"]
  },
  {
    "id": 46,
    "title": "Dinner With a Dildo",
    "content": "When you get a chance, why not surprise your sub with dinner? I know you want to make it special, so when he walks in the door, greet him wearing something sexy, and then ask him to strip before he comes any closer.\n\nOn his chair, ensure a dildo and lubricant are at hand for him. He should take his seat, and position himself upon the dildo throughout the entire meal.",
    "tags": ["Anal Focus", "Humiliation", "Power Play", "Roleplay", "Teasing"]
  },
  {
    "id": 47,
    "title": "Amazon Positions",
    "content": "Amazon positions is where the woman is thrusting instead of the man. This is a great way of showing him who’s boss.\n\nYou can begin with simpler ones like the reversed missionary position before you progress to more advanced positions. There's even a position called the Amazon position, which is quite challenging but also amazing.\n\nThe twist to this is if you have a sex swing instead of you being in it. Have him be in it and take control. A great resource for positions are Kinkly and Cosmopolitan. They offer female on top positions, regular positions, and [pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) positions.\n\n[https://www.kinkly.com/sex-positions](https://www.kinkly.com/sex-positions)\n[https://www.cosmopolitan.com/sex-love/positions/](https://www.cosmopolitan.com/sex-love/positions/)\n\nThese can be used to create a scene. Control the amount of pleasure he experiences, tease him, go slow, or go extremely slow. Or you could choose to give him an intense experience instead.",
    "tags": ["Power Play", "Anal Focus", "Roleplay", "Teasing"]
  },
  {
    "id": 48,
    "title": "Try to come",
    "content": "Place your sub in a [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE) and put a strong vibrator on it like [Wand vibrator](https://www.lovehoney.eu/search?q=wand&search-button=&lang=en_IE). Tell him that he is permitted to come. If he can do it!\n\nNow enjoy the show of watching him finger his ass, hump a pillow, try to masturbate all while still in the cage!\n\nSuper evil and very fun!",
    "tags": ["Chastity", "Orgasm Control", "Humiliation", "Power Play", "Teasing", "Anal Focus"]
  },
  {
    "id": 49,
    "title": "Not Your Dick  ",
    "content": "Command him to wear a [strap on](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) and instruct him to please you well! Why should you have to suffer not having a good fuck just because he hasn’t earned a place inside his Goddess?\n\nImagine his poor agony at doing all the work and not even being able to touch you in the way he wants. If he cant pleasure you in the way you expect, punish him.\n\nAn idea for punishment if he cant fuck you like you want is to stop him, grab his face look him straight in his eyes and say\n\n\"Since you can't fuck me like a good man, I'm going to fuck you until you can [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html).\"\n\nThen tell him to remove it. Put it on, Lube up and fuck him!\n\nWhile you fuck him ask him!\n\n\"Are you going to do a better job next time?\"",
    "tags": ["Anal Focus", "Power Play", "Humiliation", "Punishment", "Roleplay"]
  },
  {
    "id": 50,
    "title": "You had better be quick",
    "content": "Lock your sub up with his hands behind his back, then have him undress you using only his teeth. The challenge is that he needs to be quick because you've set a timer!\n\nI love to do this if we're in the middle of a month without cumming. I tell him that if he can do it before the time runs out, I’ll let him fuck me anyway he wants and cum!",
    "tags": ["Power Play", "Teasing", "Bondage", "Oral Focus", "Orgasm Control"]
  },
  {
    "id": 51,
    "title": "Make it really good",
    "content": "Start by teasing your sub and jerking him off. You can choose whether you're going to edge him or just play a bit with his cock to get him somewhat close to an orgasm.\n\nTell him that you want him to fuck you hard and make you climax. Tell him that he is not permitted to stop fucking you until he either climaxes or you do.\n\nIf he cums he should cum on or inside of your pussy. After which he will give you oral until you cum.\n\nSimple and nice! Ideal for when you're having regular sex and wish to add a touch of excitement!",
    "tags": ["Power Play", "Oral Focus", "Orgasm Control", "Teasing"]
  },
  {
    "id": 52,
    "title": "My Dick",
    "content": "[Pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) is, by far, the most empowering thing I've ever done. If I were to give you one thing on this list that you must try, it is [pegging](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html).\n\nMake him give you a blowjob, fuck him doggy style, have him ride you! Ah so much fun to be had!\n\nPlease do your self a favour and at least give it a try! Here is a great article by cosmopolitan with some great [positions](https://www.cosmopolitan.com/sex-love/positions/news/g5329/sex-positions-for-pegging/)!\n\nOne advice that I will give you is this. Take it slow and use more lube than you think you will ever need!\n\nNow obviously I wouldn’t leave you with out a scene, now would I?\n\nThe scene:\n\nStart by blindfolding him naked and and have him sit on the floor. Start to tease him, breathe in his ear, lick on his face, touch or suck on his dick, get him super turned on.\n\nContinue to tease him and while you’re doing that start to ask him questions like:\n\n\"Baby? Do you want to fuck me?\"\n\"aha, do you want to fuck me hard\"\n\"Spread my legs and fuck my tight little pussy?\"\n\nGet really close and tease him with your pussy.\n\"Is this what you want?\"\n\"Do you love my pussy? Do you wanna fuck it nice and deep?\"\n\"Well if you wanna fuck my pretty little pussy you need to let me fuck you first.\"\n\nTell him to open his mouth for you and then slide your dildo inside his mouth.\n\nTell him to suck it real good for you. Just the way that he wants you to suck his dick.\n\nThen when you’re ready tell him to turn around and to get into a position you want. And fuck his brains out!\n\nWhile you’re fucking him.Tell him how horny you get from fucking him. But also remember that he should be thankful that you the Dom his putting all this work.\n\n\"Do you know how luck you are to have your goddess fuck you like this?\"\n\n\"Let me hear you say it!\"\n\nWhen you are done you can chose if you let him fuck you or you can tell him that he has earned the reward of getting to fuck you but not now…",
    "tags": ["Anal Focus", "Power Play", "Oral Focus", "Teasing", "Bondage", "Worship"]
  },
  {
    "id": 53,
    "title": "What are the rules?",
    "content": "Before you even start your scene today. Ensure that your sub has followed the rules and that he can repeat them back to you! If he cant punish him!\n\nA fun thing to do if he failed is to have him guess the rules while you are punishing him. Every wrong answer earns him 10 extra spanks or 2 additional edges. When he finally admits that he doesn't know, make him repeat the correct answer while you spank him 15 times or edge 4 times.",
    "tags": ["Power Play", "Punishment", "Impact & Sensation", "Orgasm Control", "Roleplay"]
  },
  {
    "id": 54,
    "title": "He has no balls",
    "content": "At random during the day or before you start your scene, walk up to your sub and pull down his pants.\n\nGrab his dick, tease him with your hands or mouth. Then ask, \"Whose dick is this?\"\n\nGrab his balls and gently pull them down slightly to one side. \"Who owns these balls?\"\n\n\"Who is your mistress?\"\n\n\"What are our rules?\"\n\nNow you can either begin your scene or simply tell him to put on his pants!\n\nIf he couldn't answer or hesitated, remember this for later.",
    "tags": ["Power Play", "Teasing", "Humiliation", "Oral Focus", "Worship"]
  },
  {
    "id": 55,
    "title": "You or him? - What will he decide, to please you or to please himself?",
    "content": "Tell him to give you oral. And that if he does a good job he will \"earn\" a ruined orgasm or a spanking.\n\nIf he does a bad job, he earns a massage or sex. But never promise him an orgasm!\n\nWhat will he do? Please you with fantastic oral and take a punishment like a good sub, or will he choose to do a poor job and enjoy sex or a massage?\n\nLet's say he did a bad job, now what?\n\nFirst, have hot sex that he doesn't deserve. Enjoy it to its full extent but whisper in his ear that you will not even consider letting him cum again until the same day next week. That's the price he will pay.\n\nLive up to that and make a scene where he earns his right to an orgasm! If you don’t trust he can last a week, lock him up in a [chastity cage](https://www.lovehoney.eu/search?q=chastity+cage&search-button=&lang=en_IE). Better safe than sorry!",
    "tags": ["Power Play", "Orgasm Control", "Punishment", "Oral Focus", "Impact & Sensation", "Chastity", "Roleplay"]
  },
  {
    "id": 56,
    "title": "The Searcher",
    "content": "Tell him that he has been bad and deserves a punishment but have him search the internet for a new punishment.\n\nThe scene should fit your dominance style, so it would be wise of him to bring not one but a few ideas for you to choose from.\n\nPick the one you prefer and enjoy yourself!\n\nHowever, do keep in mind that many subs will only bring something that would penalize them, but may not satisfy you. Be sure his punishment isn't just a lot of work for you!",
    "tags": ["Power Play", "Punishment", "Roleplay", "Worship"]
  },
  {
    "id": 57,
    "title": "Hard On Demand",
    "content": "At random times throughout the week demand that your sub show you his erect cock. You can set a time limit on how long he has to get fully hard, or leave it open ended so that he has to keep trying until it happens.\n\nWhen he is erect, compliment him and tell him to put it away. \"It's not playtime yet\" then continue with what you were doing.\n\nIf he cannot get hard, take note and punish him at the end of the week. Let's say he couldn't get hard 10 times, you can say that now he has to edge 10 times for you. Or that you will spank him 100 times.",
    "tags": ["Power Play", "Orgasm Control", "Teasing", "Punishment", "Humiliation"]
  },
  {
    "id": 58,
    "title": "Fuck Him Gently",
    "content": "Reward your sub, and yourself, with a night of genuine passion and great sex. Take the lead, of course, but make it amazing and fun. Tell him how handsome he is, how lucky you are to have him. Let him tell you what position he’d like to do…",
    "tags": ["Power Play", "Worship", "Roleplay"]
  },
  {
    "id": 59,
    "title": "The Throne ",
    "content": "This is Real Power Scene. You will be seated in a chair, place a [remote controlled Prostate toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) in his ass, while he kneels naked before you.\n\nAsk him who he belongs to?\nAsk him who owns his dick and ass?\nAsk him what he worships?\n\nTell him to kiss your high heels. Tell him to clean them, make them shine.\n\nAsk him if he deserves to kiss your feet.\n\nTell him to remove your shoes and give you a foot massage. If he does well, order him to kiss them.\n\nOnce finished, have him perform oral sex on you, or use a toy on yourself.\n\nIf he performs poorly, buzz the toy or whip him with your whip!",
    "tags": ["Power Play", "Worship", "Anal Focus", "Oral Focus", "Humiliation", "Impact & Sensation"]
  },
  {
    "id": 60,
    "title": "Now you know",
    "content": "This one is super simple. Have sex just as you wish. Oral, doggy style, or whatever takes your fancy. There's no necessity for a femdom involvement if that's not your preference.\n\nWhen you are finished, stop the action. Tell him that he hasn't earned the right to climax. So he will not climax tonight unless he can offer you something?\n\nListen to what he offers you. If you like it, make him climax. If you don't like it, tell him he has to offer you something better. Or say no and end the scene right then and there.",
    "tags": ["Power Play", "Orgasm Control", "Roleplay"]
  },
  {
    "id": 61,
    "title": "Be A Jerk-off ",
    "content": "This is something light and easy, have your man strip naked and seat him in a chair or even on the floor. Inform him of these rules: no talking, no touching. You don’t need to tie him up because a good sub will listen and do as instructed.\n\nGet your body close to his face and start masturbating. Get as close as you can without touching. Let him see what you do, tell him that's how your beautiful pussy should be treated.\n\nWhen you cum, if he listened to you and didn't try to touch you, inform him that he may pleasure himself after you leave the room. If he did slip up, tell him you are both done for the night and he may not masturbate for 24 hours. Remember, in this relationship, you control everyone's orgasms. Make sure he knows that.",
    "tags": ["Power Play", "Teasing", "Orgasm Control", "Humiliation", "Roleplay"]
  },
  {
    "id": 62,
    "title": "Come up with - A Simple Punishment.",
    "content": "Have him watch you use your favorite dildo or vibrator and cum in front of him, as he is not allowed to touch, talk, or do anything while you masturbate. He will sit with a ball gag and remain quiet until you are finished.\n\nThen ask him if he wants to taste you. He will say yes.\n\nHave him promise that he will be a better sub!\n\nInstead of having him taste your pussy directly, have him taste the cum from your toy.\n\nTell him that only good subs get to taste their goddess's cum directly from her pussy. Very sexy.\n\nP.S. Don’t forget to put on a show when pleasing yourself with your toy/toys. Give that toy an amazing blowjob right in front of his face, have him suck on it to lubricate it. Be loud and ensure he knows just how good it feels.",
    "tags": ["Power Play", "Humiliation", "Oral Focus", "Bondage", "Punishment", "Teasing"]
  },
  {
    "id": 63,
    "title": "The Orgasm ",
    "content": "Tell him this on Friday. You want him to make you cum but he is not allowed to use any technique that he has tried before! That means he has to research new toys, fingering, oral techniques. It has to be kept fresh!\n\nAn alternative to this is to tell him that he will fuck you on Friday, but again, he is not allowed to use any tried and tested tricks or positions. Only new ones! This can also be done with a massage if you're not feeling like having sexual intercourse.\n\nHowever, remember that whatever you choose - sex or a massage - it needs to be good! Really good!\n\nI enjoy doing this, as it has introduced many amazing positions into our sex life!",
    "tags": ["Power Play", "Oral Focus", "Worship", "Roleplay"]
  },
  {
    "id": 64,
    "title": "Testing the Waters ",
    "content": "This scene is designed for you as a dom to learn how hard you can spank your sub.\n\nBring out a whip and begin spanking your sub after each hit, as he will give you a number from 1 to 10. \n\n1 indicates no pain, while 10 represents maximum pain. This will help you in the future to know how hard you can spank your sub.",
    "tags": ["Impact & Sensation", "Power Play", "Roleplay"]
  },
  {
    "id": 65,
    "title": "A Nice Face to Sit - Every queen deserves a throne! His face is yours.",
    "content": "Sit on his face and have him eat you out. Pull his hair or grind on his mouth. Tell him how you're going to own him tonight!\n\nDon't forget to turn around so you're facing his feet. Now you can play with his dick while he is licking your pussy or ass. Tease him with a feather, ice cube, or flashlight and play with him.",
    "tags": ["Worship", "Oral Focus", "Humiliation", "Power Play", "Teasing"]
  },
  {
    "id": 66,
    "title": "A Good Fuck",
    "content": "This is a  [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) scene that I enjoy when I want sex. However, I'm tired after work and simply don't feel like doing something elaborate. A [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) is great because there is no question about who's the boss. Yet, it requires no effort to use.\n\nGrab your [Leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) and place it on him. Now, enjoy each of the following steps in order:\n\nHave him massage your head and hair thoroughly. Follow with a full body massage that includes foot rubbing. He should then express his adoration for you by kissing every part of your body, telling how much he worships you.\n\nThen, he should give oral. Proceed to have sex in positions you prefer with NO effort required from you. Once completed, allow him to give you a rim job as you relax.\n\nRemember to lead him through each part of the scene using your [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html). This scene is intended for relaxation and pleasure solely for you, so he should NOT expect to be allowed to cum!",
    "tags": ["Bondage", "Worship", "Oral Focus", "Power Play", "Roleplay"]
  },
  {
    "id": 67,
    "title": "Place the X in Sex",
    "content": "Perform a scene featuring your sub restrained in a bed with a gag in their mouth.\n\nHere is an idea to get you started, you will leave him right after you have cum as that's the most crucial part of the scene ;)\n\nTease him, lick his ear, bite his nipples and dick.\n\nTell him how much you're looking forward to playing with him tonight. Tell him how much you want him to make you orgasm. Say that you want him to make you cum using his mouth.\n\nThen get on top of him and start to grind your pussy against the [ballgag.](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) Tell him that he needs to put more effort in and that you are not reaching climax. Tell him to stick out his tongue, and be disappointed when he can't. Stop and say that you are disappointed and thought he wanted to make you orgasm.\n\nGet a [vibrating dildo](https://www.lovehoney.eu/sex-toys/dildos/vibrating-dildos/#pid=Tilea410g410) and suck on it while laying next to him. Ask him if this is the dick he wants, \"Well, you haven’t earned it yet.\"\n\nThen use the dildo and make yourself cum,\n\nNow start to play with his dick again. Bite it, kiss it, place it between your lips.\n\nTell him that you are not finished yet. And that he is not going to cum for a long time.\n\nThen get on top of him once more and start riding him. While you're riding him, use the vibrator until you reach orgasm.\n\nFrom here, you can take the scene wherever you like. Continue playing with his dick or insert the dildo into his ass before making him climax, Have fun! ;)",
    "tags": ["Bondage", "Teasing", "Power Play", "Oral Focus", "Anal Focus", "Orgasm Control"]
  },
  {
    "id": 68,
    "title": "Spanking Session",
    "content": "Time for a spanking session. Spank your sub ten times with each of your whips. Have him count out loud every hit! Don't forget his balls!\n\nSpend some extra time practicing with your [flogger](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) technique. If you don't have the technique mastered yet, this is a great scene to practice!\n\nHere are some fun techniques for you to try:\n\nA.) The Carousel - Spin the [floggers](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) in each hand fast enough so that the tails fly out and tickle the skin.\n\nB.) The Snap - Pull the tails of the [flogger](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) and use them like a slingshot! Pull them back, then release them!\n\nC.) Horizontal Whip - Strike the body horizontally, usually across the bottom.\n\nD.) Figure of Eight - Use one [flogger](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) in a figure-of-eight motion across the bottom and up and down the back, making impact with specific areas. Double the heat by using two [floggers](https://www.lovehoney.eu/search?q=flogger&search-button=&lang=en_IE) and use one in each hand.",
    "tags": ["Impact & Sensation", "Punishment", "Power Play"]
  },
  {
    "id": 69,
    "title": "Light Cock and Ball Torture",
    "content": "This sounds extreme, but it doesn't necessarily have to be! \nA.) Spank his ass with your whip\nB.) Spank his erect dick.\nC.) While giving him a blowjob, bite his dick or testicles.\nD.) Get a [cock leash](https://www.lovehoney.eu/bondage/cock-ball-toys/ball-stretchers-dividers/p/dominix-deluxe-leather-ball-strap-with-lead/a35602g65086.html) and use it instead of your normal [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html).\nE.) Suck hard on his balls.",
    "tags": ["Impact & Sensation", "Oral Focus", "Bondage", "Punishment", "Power Play"]
  },
  {
    "id": 70,
    "title": "Cream Pie",
    "content": "When he has been either extra good or bad, have him cum inside of you. \n\nOnce completed, have him tidy it up with his mouth. Super hot and a great way to end a scene!",
    "tags": ["Oral Focus", "Humiliation", "Power Play"]
  },
  {
    "id": 71,
    "title": "Almost there - This is a tease scene.",
    "content": "Tie your sub up really good. Tell him that he has been a good boy and deserves a reward. He is gonna get to fuck your pussy really really hard.\n\nNow make sure that your pussy is just just out of reach. Maybe let only the head of his dick in your pussy. Tease him like this for however long you want! Super hot!\n\n\"What’s the matter baby? Stick it in\"\n\"Don’t you want to fuck my pussy?\" \n\"Don’t make me disappointed.\"",
    "tags": ["Teasing", "Orgasm Control", "Power Play", "Bondage", "Humiliation"]
  },
  {
    "id": 72,
    "title": "Not Just For Me",
    "content": "Has your sub not pleased you enough but you still want to see cum? Get a [vibrator wand ](https://www.lovehoney.eu/search?q=wand&search-button=&lang=en_IE) to stimulate the head of his dick. He will cum, but it will be really hard for him which is super fun to watch. \n\nIf you have a toy this can be great time to put that on his dick as well. The vibrator will vibrate the toy which will be an insane experience for him!",
    "tags": ["Orgasm Control", "Power Play", "Impact & Sensation", "Teasing"]
  },
  {
    "id": 73,
    "title": "Shush-hush ",
    "content": "I love [ball gags](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html). [Ball gags](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) are often forgotten about which is a shame.\n\nA.) Tell him that he must be quiet if he doesn't [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him and spank him! Or punish him another way!\nB.) Is he not respecting your dominance? For example saying things that he wants to do or you do to him? Like swallow my cum or I want to cum on your face? [Ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him and punish him!\nC.) [Ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him and then tell him to make you cum with the [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html). If he can't, punish him!",
    "tags": ["Bondage", "Power Play", "Oral Focus", "Punishment", "Humiliation"]
  },
  {
    "id": 74,
    "title": "Kiss and Tell ",
    "content": "Tell him that you want him to worship you with his words and kisses.\n\nGive him 10 seconds or 20 seconds. Every second, he must kiss you, and the next second, he will give you a compliment. However, the trick is that he cannot repeat the compliment! This is super challenging, and I bet he won't be able to do it. If he can't, you can tell him that you will punish him. Love this one!\n\nAt the end, you can say something like:\n\n\"I'm so disappointed in you!\"\n\n\"I thought you worshiped me.\"\n\n\"But you can't even come up with 10 compliments in 20 seconds.\"",
    "tags": ["Power Play", "Worship", "Teasing", "Punishment", "Humiliation", "Oral Focus"]
  },
  {
    "id": 75,
    "title": "Hold on",
    "content": "Get a tray and a bottle, either with or without water. Ask him how long he can hold the bottle on the tray with an extended arm. The correct answer is obviously for as long as you desire. You will set a timer. Let's say 5 minutes (this could be 10 minutes or up to an hour, depending on your preference). Now the fun begins.\n\nHe must hold the tray with the bottle on top with an extended arm for the full 5 minutes with out dropping it! You can jerk him off, spank him, kiss him or do whatever your want. If he fails punish him, if he makes it reward him!",
    "tags": ["Power Play", "Impact & Sensation", "Orgasm Control", "Punishment", "Teasing", "Roleplay"]
  },
  {
    "id": 76,
    "title": "Unleash yourself ",
    "content": "A [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) is a great way to control your sub in play! It’s a great way to \"show\" your sub what you want him to do. For example, you want him to lick your pussy? Pull him close with the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html). Or if you're getting a massage and you want him to move up your body, pull on the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html). Want him to kiss your feet? Grab the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) and pull him down.\n\nHonestly, get a sexy [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) that you like and start using it. I always use a [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) in my sessions!\n\nHere's a start to a scene that uses a [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) as a main tool.\n\nHave him strip naked and place the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) on him. Lead him to the bedroom, he should be crawling on all fours. Grab the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) and pull him close to your face.\n\n\"Are you going to be a good boy for me?\"\n\nHave him start kissing your shoes. When you are pleased, pull him up and make him start kissing your legs. As he starts to come close to your vagina, grab the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) so he just can't reach it.\n\n\"Do you deserve to taste my perfect pussy?\"\n\n\"Beg for it!\"\n\nThen let him start to kiss your pussy. But just as he starts to enjoy it, pull him away. Make him say why he deserves to continue. Then have him give you an orgasm.\n\nYou see how much of a powerful tool the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) is? Super sexy and easy to use. :)",
    "tags": ["Bondage", "Worship", "Teasing", "Power Play", "Oral Focus", "Humiliation"]
  },
  {
    "id": 77,
    "title": "The Plug",
    "content": "Tell your sub to send you a picture of him wearing his butt plug at work!",
    "tags": ["Anal Focus", "Humiliation", "Power Play", "Public", "Teasing"]
  },
  {
    "id": 78,
    "title": "Pointers for Pointers - This scene is supremely sweet!",
    "content": "Tie your Sub to the bed, or have him standing in front of a mirror with his hands bound behind his back. \n\nThen either get on top of him or behind him depending on the position and really slowly just point out all the parts of his body that you love and how lucky you are to have his loyalty and submission.\n\nI love this especially right after an intense scene or just to show my love!",
    "tags": ["Worship", "Power Play", "Bondage", "Roleplay"]
  },
  {
    "id": 79,
    "title": "The interrogator ",
    "content": "Its time to get freaky! This one can get really wild! The interrogator is great if you want a real challenge.\n\nThe idea is simple. He’s is going to have a word in his head or code.Your job is to get that Code out of him!\n\nThere are 3 Rules.\n\nA.)He is not allowed to cum.And you can not make him cum. If he says he is close you have to stop whatever you’re doing.\n\nB.) If he cums anyways he looses. He should have told you earlier.\n\nC.) You only have 1 hour. So make every minute count you ain’t got much time!!\n\nin order for this scene to work you need a really good price for the winner, and a really fun punishment for the loser. Make it nasty and sexy!\n\nHere are the prices we used last time!\n\nIf I win he will pay for a new toy a whip and lingerie set of my choosing, he will swallow his cum, and he will not be allowed to cum for one week. When he is allowed to cum after a week it will be ruined!\n\nHe wins, he get to cum in my mouth and I will swallow. He gets 10 free blowjobs that i will give him at anytime. I will buy a sexy lingerie set and surprise him.\n\nNow that you have your prices.\n\nHere is an idea of what I did last time we played this.\n\n(Warning we get freaky when we play this, we are both super competitive)\n\nI stripped him completely naked. I spanked him hard, I got a [remote controlled dildo](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) and I put it up his ass. Then I pulled his hair towards a chair. I taped him into the chair using [BDSM](https://www.lovehoney.eu/bondage/handcuffs-restraints/bondage-rope-tape/p/lovehoney-black-bondage-tape/a71g71.html) tape. Put a blindfold on him then I told him to open his mouth, I leaned in and whispered in his ear \"I'm gonna make you my bitch\". Then right before I [ball gagged](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) him I dripped just a little of my spit in his mouth.\n\nThen I walked out of the room. Occasionally I would turn on the vibrator with a remote. I put on my most kinky latex outfit on. Feeling powerful and sexy as fuck after about 10 minutes I came back and removed the gag. I talked to him while spanking him and asked for the code. I made sure that I was a real fucking bitch, I spanked him hard, slapped his face and dick, bit his ear and dick, called him names all while asking for the code. I did this for about 10 - 20 minutes.\n\nThen I did a Complete switch! I started kissing him, telling him how cute he is. How much I just want this to be over, so he can fuck me hard.While sitting in his lap I whispered in his ear \"Just give the code honey and we can have some real fun\", \"please don’t you want to fuck me?\",\"Baby I need your dick inside of me\"\n\nI gave him a hand job, and even sucked his dick a little. Then I whispered in his ear again and slightly lifted the blindfold so he just could see my outfit. \"All this can be yours..\" Then I put the blindfold back fully on. I could see that he wanted so so bad to give me the code. But my sub was stubborn and said no.\n\nWell I made sure to have a plan for this. I put the gag on and went back into bitch mode! I turned the dildo in his ass to max speed. And Started to Jerk him off until he was on the edge. When he said that he was going to cum. I took some frozen grapes in my hand and put them around his dick and balls. Then I placed them around is body. I continued to ask for the code but he said no. So I got a BDSM candle and started to pour wax on his body. When the wax got hard I went down on him and started to suck on his dick. When I saw that he enjoyed it I bit on his dick. And asked for the code.\n\nAfter that I took my whip and whipped the cold wax off his body. For every hit I did I asked for the code. I could tell that after the 30 - 40 minutes of play he was dying to give me the code. But he still said no.\n\nWhen all the wax was gone I asked him if he wanted to fuck me? And he said yes. I said \"But baby you’ve already made it clear that you don’t want to fuck me. So since you don’t want to fuck me, I’m gonna fuck you.\" I pulled off the blindfold and saw his eyes become wide open. I was standing right infront of him with my [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html) in my latex body.\n\nWell I think you can figure out what happened next. Bitch got the code! ;)\n\nBut I will say it’s not always that I’ve won. So if you’re gonna do this. You have to be in your A game! Prepare before you start otherwise your gonna be in for a tough time! Good luck!",
    "tags": ["Power Play", "Roleplay", "Impact & Sensation", "Bondage", "Humiliation", "Anal Focus", "Oral Focus", "Teasing", "Punishment", "Orgasm Control"]
  },
  {
    "id": 80,
    "title": "Roll the die ",
    "content": "Get a die and inform it that if it scores higher than you, he gets to cum. If not, he has to wait for the number of days he lost by! For example, he rolls a 2 and you roll a 6. No cumming for 4 days!\n\nIf he does actually win, he is allowed to come, but only after being edged the number of times he won by. So, if he got a 6 and wins, he must edge six times before he can come.",
    "tags": ["Power Play", "Orgasm Control", "Roleplay"]
  },
  {
    "id": 81,
    "title": "Instructor",
    "content": "Provide instructions on how he can please you. The trick here is to be extremely picky and specific! Where should he touch, how firmly should he touch, where should he lick, kiss, etc.\n\nThis is surprisingly hot, and it's a great way to begin exploring Femdom.",
    "tags": ["Power Play", "Worship", "Oral Focus", "Roleplay"]
  },
  {
    "id": 82,
    "title": "Write it down!",
    "content": "Use a lipstick or a pen and write on your sub while you dominate him.\n\nI like him to say each of our rules aloud, and while he does, I write them on his body with lipstick.",
    "tags": ["Power Play", "Humiliation", "Worship", "Roleplay"]
  },
  {
    "id": 83,
    "title": "Dual Dildo",
    "content": "Have him put on a [dildo gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-large-silicone-ball-gag-with-dildo/a38375g70758.html). Then attach a suction cup dildo to the wall. He will be on all four with the dildo on the wall in his ass.\n\nNow every time he pushes forward he fucks you with the dildo on his face. Every time he goes back the dildo on the wall fucks his ass!\n\nGreat, isn't it!",
    "tags": ["Anal Focus", "Oral Focus", "Bondage", "Power Play", "Humiliation"]
  },
  {
    "id": 84,
    "title": "Not yet",
    "content": "Do an entire session where you almost pull down his underwear but never do. Make sure that every time he thinks you gonna pull them down don’t!\n\nMake him work for you to pull them down, make him earn it!\n\nIf he can't do it, jerk him off to orgasm without pulling down his underwear and obviously ruin his orgasm.",
    "tags": ["Teasing", "Orgasm Control", "Power Play", "Humiliation"]
  },
  {
    "id": 85,
    "title": "Did you think I had forgotten?",
    "content": "This is a starter idea, with a surprise twist for the sub.\n\nNext time your sub does something bad, don't punish him immediately. Wait until he forgets. When the moment is right, tell him you're going to give him a nice massage. Blindfold him and go get your toys. Then return, oil him up well, and start massaging him.\n\nAfter a while, when he is completely relaxed, lube up your [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html). whisper in his ear, \"Do you remember that thing you did? Well, I didn't punish you for that. Did you think I forgot?\"\n\nThe trick is to really ensure that he will not suspect anything. So, try to play it cool!",
    "tags": ["Punishment", "Anal Focus", "Power Play", "Teasing", "Bondage", "Roleplay"]
  },
  {
    "id": 86,
    "title": "The Choice is Yours ",
    "content": "Bring out six of your favorite whips. Lay them out on the bed. Next, take a dildo and Insert it into your sub's ass.\n\nGet a die and tell him to roll it twice.\n\nThe first roll: Determines how many times he will be punished.\n\nThe second roll: Determines the number of strikes from the whip he will receive each time he is punished.\n\nHowever, whatever number he lands on should be doubled! So 1 becomes 2, 2 becomes 4, 3 becomes 6 and so on.\n\nNow let's say he gets a 2 the first time and 4 the second time. He will be punished twice with 8 spanks each.\n\nNext, decide whether he rolls again or you roll the die. Whatever number it lands on, use the corresponding whip.\n\nRemember: If at any point he drops the dildo from his ass, he will receive 10 extra spanks and another punishment. This raises the total from 2 to 3 in the above example.",
    "tags": ["Power Play", "Impact & Sensation", "Anal Focus", "Punishment", "Roleplay"]
  },
  {
    "id": 87,
    "title": "I want them sparkling",
    "content": "Get something edible, but somewhat difficult to remove with just a tongue, such as honey or chocolate.\n\nNow, spread it on you and have him clean it up using only his tongue. Easy!\n\nYou can take this as far as you like. Sometimes I enjoy putting some of it on a pair of some sexy high heels and have him slowly work himself up to my pussy.\n\nOr, you can spread it on your ass and have him lick it all off!",
    "tags": ["Worship", "Oral Focus", "Humiliation", "Teasing"]
  },
  {
    "id": 88,
    "title": "Surprise!",
    "content": "Start by lighting candles, put on some chill music and really set the mood for some love time. Instruct your sub to be fully naked and wear a [blindfold](https://www.lovehoney.eu/search?q=blindfold&search-button=&lang=en_IE). Ensure that he follows your order before you continue.\n\nThen enter the room and begin by giving your sub a soothing massage using plenty of oil. Rub your tits against his back, kiss him, and whisper stuff in his ear.\n\nAs he becomes completely relaxed, you will gradually start to penetrate him from behind with your [pegging kit](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html). Continue to massage him during this process.\n\nNext, take some frozen grapes and place them in your mouth. Start kissing him while you continue to fuck and massage him.\n\nThis scene is incredibly hot. A femdom massage! Once finished, you can turn him around for a normal fuck! The stage is set to take the experience wherever you wish!\n\nSay something like \"Now I’ve fucked you, now i want you to fuck me!\" Super hot! Give this one a try!",
    "tags": ["Anal Focus", "Impact & Sensation", "Teasing", "Power Play", "Bondage", "Oral Focus", "Worship", "Roleplay"]
  },
  {
    "id": 89,
    "title": "A Devastating Blowjob ",
    "content": "Here are some great tips for blowjobs that will make him desperate to climax!\n\nA.) Kissing - Start by just kissing the tip of his dick. Then advance to use your lips to tease his dick.\nOpen your lips slightly so that you can gently squeeze the tip of his dick between them. With saliva on your lips, gently run them over his dick. Use your lips to gently suck on the top of his dick.\n\nB.) The Twister – Using your tongue and lots of saliva, you can perform an ultra-pleasurable and satisfying blow job technique I like to call the Twister. While holding his dick steady in one hand, make slow circular motions with your tongue around the top of his dick. Alternate direction and speed to add some variety, but this blissful BJ technique alone is enough to bring him to a thundering climax.\n\nC.) Slip Inside - A less advanced BJ technique is as effective at providing him with intense stimulation as deep throating him. This involves using the inside of your mouth. By taking him into your mouth and pressing/rubbing the tip of his dick against the inside of your cheek and tongue. Boom, simple and you have another tool for your blow job arsenal.\n\nD.) Use The Roof – Carrying on from the previous technique, there’s another option for stimulating him: the roof of your mouth. If you think it can't help you when giving him a blow job, you're wrong. The texture feels great when you angle his dick so that the top of his glans moves against the ridges on the roof of your mouth.",
    "tags": ["Oral Focus", "Teasing"]
  },
  {
    "id": 90,
    "title": "Stack them up! ",
    "content": "Tie him up with his hand behind is back. Then take a spoon, an ice cream or a whip and place it in his mouth.\n\nNow get some dice, his job is to stack as many dice has he can on top of each other, on the tip of your whip!\n\nOnce he fails and all the dice fall to the floor do this:\n\nEach stack of dice give him 10 seconds.\n\nSo let say he stacked 4 dice on top of each other, he now has 40 second to cum!\n\nBoom your done, But wait there is more!\n\nIf you want to have some more fun you can say that the highest number that a dice rolled. When it fell to the floor. That's the amount of times he has to edge before cumming.\n\nSo let’s say he stacks 4 dice, and the highest number of these 4 after falling where 2.\n\nThen he has 40 seconds to cum and has to edge twice before being allowed to cum! If he cant finish in time no cumming, game over!\n\nBut wait there is even more!\n\nIf you just can’t get enough of stacking dice on a whip, here is another game that also requires him to stack dice on a whip.\n\nHe is going to edge for you 10 times. But for each layer of dice he stacks he gets 1 edge discount.\n\nAnd when all the dice fall they must at least score 15 or higher. Otherwise he will not be allowed to cum!\n\nSo let’s say he stacks 5 dices and when they fell they added up to 17. Great! He has to edge 5 times (5 - 10 = 5). And since he scored over 15 he gets to cum!\n\nNow I’m done I promise...",
    "tags": ["Power Play", "Orgasm Control", "Bondage", "Oral Focus", "Roleplay", "Teasing"]
  },
  {
    "id": 91,
    "title": "Where do you want to conclude",
    "content": "Before you start ask him where he wants to cum.\n\nHe can chose:\n\nA.) Face / Mouth\n\nB.) Body / Tits\n\nC.) Ass\n\nD.) Pussy\n\nNow continue you scene. Depending on his answer different things will happen!\n\nA.) Your face / Mouth: Tie him up and let him cum in your mouth, but slowly work your way up and push it into his mouth. Tell him to swallow it!\n\nB.) Body / Tits: Tell him that every time you snap your fingers he is to kiss, suck and worship your tits. Then continue with your scene. And from time to time snap your finger and have him worship your tits.\n\nThen by the end of the scene. Take some pillows and put them against the wall by your bed (sit against the wall like if you where sitting in a couch). Then have him straddle your pegging kit and ride you.His dick will now be right by your tits. Tell him to ride you hard while you jerk his dick. Have him cum on your tits.\n\nThen snap your finger……\n\nC.) Ass : Tie him up with his hands above his head in the bed. Then as you are pegging him you will jerk his cock. Ask him if he wants to cum! Make him beg for it. Let him cum while you’re fucking him.\n\nD.) Pussy : Tie him up with his hands above his head.Then jerk him off or fuck him depending on how close he is. Just make sure that when he is just about to cum. Make him cum in or on your pussy. When he is done move your pussy up to his face and have him clean it all up. The mix of his cum and your pussy juice will be amazing!",
    "tags": ["Power Play", "Orgasm Control", "Oral Focus", "Humiliation", "Bondage", "Worship", "Anal Focus", "Roleplay"]
  },
  {
    "id": 92,
    "title": "The Trick",
    "content": "This scene will trick your sub into making a mistake so that you can punish him!\n\nTell him how you really want to cum from oral. Tell him you’re desperate for him lick your pussy the only way he can.\n\nHave him kneel and stand In front of him and tell him to put his tongue out. Now put your ass and pussy close to him but not close enough so that he can reach.\n\nTell him to pull down your panties and ask him if he wants to kiss your ass, he will say yes. Give him permission to kiss it, as he start to kiss it grab his hair and really make him make out with your asscheeks. Then you gonna really quickly push his face towards your asshole and make him lick it.\n\nRight after your gonna act super choked and say something like\n\n\"Babe, did I give you permission lick my ass? Well now you can’t lick my pussy!!\"\n\nAnd now you can take the scene anywhere you want. You can punish him or you can tease him with your pussy. Cum right in front of his face the sky is the limit!",
    "tags": ["Power Play", "Teasing", "Oral Focus", "Humiliation", "Punishment", "Roleplay"]
  },
  {
    "id": 93,
    "title": "Toys can be Fun ",
    "content": "For this, a toy or pocket pussy is a great tool!\n\nYou are going to tie him up, spreading him out across the bed like a star. Then you're going to use him however you like - ride him, make him perform oral sex on you, and so on.\n\nIn the end, have him cum right on his belly. But when he does, stop touching his dick to prevent him from ruining it.\n\nTell him that he has made such a mess and that you have to go clean up.\n\nGo away for 5 minutes and take a shower, clean yourself and your pussy. Then come back with a dildo/[buttplug](https://www.lovehoney.eu/sex-toys/butt-plugs/jewelled-butt-plugs/p/lovehoney-jewelled-metal-beginners-butt-plug-2.5-inch/a40364g73767.html) and a [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) in your hand. Start playing with his ass and dick until he gets hard again.\n\nJerk him off until he is just about to cum. Tell him that if he does, he must help you clean up.\n\nIf he says no, ruin his orgasm. Leave the dildo inside of him and go away again for 5 minutes. Then repeat until he agrees to clean up. You can choose whether cleaning up means with his mouth or just with some paper. But don't tell him how he will clean it up, until he agrees to do it.\n\nThe fun part about this one is that he expects the scene to be over the first time you leave. And that he is tricked into thinking that he has to taste his cum even though that's not the plan. ;)",
    "tags": ["Orgasm Control", "Teasing", "Power Play", "Bondage", "Anal Focus", "Humiliation", "Roleplay"]
  },
  {
    "id": 94,
    "title": "Work it ",
    "content": "Have him wear a [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html) and tell him that he is going to make you cum. However, he can only use the [ball gag](https://www.lovehoney.eu/bondage/blindfolds-masks-gags/gags/p/bondage-boutique-faux-leather-medium-silicone-ball-gag/a34001g60999.html). Then, set a time, for instance, 5 minutes. If he manages to do it, great! If he doesn't, punish him.\n\nSimple! I love this one!",
    "tags": ["Oral Focus", "Bondage", "Power Play", "Punishment", "Roleplay"]
  },
  {
    "id": 95,
    "title": "I'm right behind you.",
    "content": "Have him stand up, and place a lubed [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) on the bed. Stand behind him and enter him with your [pegging kit.](https://www.lovehoney.eu/sex-toys/strap-ons/strap-on-harnesses-kits/p/tracey-cox-supersex-strap-on-pegging-kit-4-piece/a40176g73449.html).\n\nNow tell him to fuck the [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html) on the bed. As he thrusts, he will also be getting his ass fucked.\n\nSince you are standing right behind him and don’t have to do any work, touch his body, kiss his neck, and nibble his ear. Whisper things like:\n\n\"Fuck that tight little pussy for me.\"\n\n\"Do you want to finish inside of me?\"\n\n\"Fuck that pussy, show me you want it.\"\n\nFrom time to time, you can make him stop fucking the [fleshlight](https://www.lovehoney.eu/sex-toys/male-sex-toys/realistic-vaginas/p/fleshlight-pink-lady-stamina-training-unit-stu/a13190g13421.html). Grab his dick with one hand and jerk him off, while you stand behind him and fuck him!\n\nIt's so hot to feel his body heat and sweat..",
    "tags": ["Anal Focus", "Power Play", "Teasing", "Oral Focus", "Roleplay"]
  },
  {
    "id": 96,
    "title": "Riding Your Face ",
    "content": "Tie Your sub up in a X fashion and put a dildo gag on him!\n\nThen, begin to ride his face. Your pussy juices and cum will flow down the gag into his mouth. Incredibly hot!",
    "tags": ["Worship", "Oral Focus", "Humiliation", "Bondage", "Power Play"]
  },
  {
    "id": 97,
    "title": "NAKD",
    "content": "Begin your scene entirely clothed, then have him be naked.\n\nGive him tasks such as edging, begging, playing with his ass...\n\nWhen he does something that really pleases you. You will remove one thing.\n\nI like to do this while wearing something super sexy. This drives my sub even more crazy and he will do the most fun things just to see more!",
    "tags": ["Power Play", "Teasing", "Worship", "Orgasm Control", "Anal Focus", "Humiliation", "Roleplay"]
  },
  {
    "id": 98,
    "title": "Good boy",
    "content": "Next time you're doing your makeup and styling your hair, whether it's for going out or for a scene, have your sub eat your ass out while you get fixed.\n\nPut a [leash](mailto:https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) on him and pull the [leash](https://www.lovehoney.eu/bondage/handcuffs-restraints/collars-and-leads/p/bondage-boutique-faux-snakeskin-collar-with-lead/a40499g74000.html) between your legs. Now tug on it hard and force his face into your ass! You have full control while getting ready.\n\nWhen you are done tell him to crawl behind you to the bedroom! Then start your scene. An added idea to this is to have a [remote controlled toy](https://www.lovehoney.eu/sex-toys/male-sex-toys/prostate-massagers/p/lovehoney-high-roller-remote-control-rotating-prostate-massager/a42638g76716.html) in his ass while you are preparing. This way, you can entertain yourself with him while doing your makeup.",
    "tags": ["Worship", "Oral Focus", "Anal Focus", "Power Play", "Bondage", "Humiliation", "Roleplay"]
  },
  {
    "id": 99,
    "title": "How do you prefer it?",
    "content": "Why must you always have to know what to do? In this scene you don't.\n\nHave your sub tell you how he should be dominated, it can be very submissive for a man to say that he wants you to peg his ass, or to spank him, or force him to eat his cum.\n\nJust remember that whatever he comes up with, it should focus on your pleasure not only his!\n\nI also love to do this when I have an idea of what I want to do but want him to guess it. Especially if it’s something like pegging where it might not be his first guess.",
    "tags": ["Power Play", "Roleplay", "Worship", "Anal Focus", "Impact & Sensation", "Oral Focus", "Humiliation"]
  },
  {
    "id": 100,
    "title": "The Pile Driver",
    "content": "In this game you sub is going to be in the pile driver position (start by laying him on the floor, raise his legs up and over his head, now he is balancing on his shoulder with his dick right in front of his face.)\n\nNow you are going to play a jerk off game.\n\nYou have 5 minute to make him cum. If he win don’t cum he may cum where ever he wants.\n\nBut if he loses this position will make him cum on his own face!\n\nThat’s going to be quite the incentive not to lose!",
    "tags": ["Power Play", "Orgasm Control", "Humiliation", "Roleplay"]
  },
  {
    "id": 101,
    "title": "Training ",
    "content": "Don't you just hate having to explain which position he should assume? Train him to remember various positions and the corresponding commands.\n\nKneel - on his knees hands on his legs\n\nAss - on his knees with hands on the floor and presenting his ass.\n\nDoggy - all four doggystyle\n\nHands - hands forward ready for cuffs\n\nSpread - standing spreader legs ready for leg spreaders.\n\n69 - lay flat on floor or bed\n\nHands back - hand behind his back ready for cuffs\n\nWall - hands against the wall legs spread\n\nFind the positions that you want to use and train him to learn them. Then have him complete a test if he fails punish him. Remember that all positions should be performed to perfection! Inspect with a whip at hand!",
    "tags": ["Power Play", "Worship", "Roleplay", "Punishment", "Bondage"]
  },
  {
    "id": 102,
    "title": "Eat my Shit",
    "content": "This is a scene which takes place in the toilet. \n\nOn a day where you have eaten some really spicy food or something which upsets your stomach, tell your sub that your stomach feels a bit off and he might have to help with it.\n\nMake sure to tell it in such a way so that he doesn't suspect it's anything femdom.\n\nGo to the toilet and call him asking for something like toilet paper, when he enters tell him to lie down on the floor and to shut up if not he doesn't get to use the toilet for a whole day (yes not even to pee). \n\nPosition your asshole over his face and unleash your fury on him. \n\nOffer him a choice, he can eat it all and get to fuck you however he wants, but if he refuses he has to stay there with shit on his face for as long as you want.\n\nMake sure he cleans up after the scene is over, watching him clean up is very fun!\n\n",
    "tags": ["Scat & Watersports", "Humiliation", "Power Play", "Oral Focus", "Roleplay"]
  },
  {
    "id": 103,
    "title": "Golden Shower",
    "content": "Start this scene early in the day. Tell him he’s your personal toilet for the whole day, no exceptions. First, let him think he has a choice: catch your pee either with his mouth or in a container. Tell him that if he spills anything he will suffer.\n\nBut here’s the catch, if he picks the container it’ll get emptied… into his mouth, no matter what. No real choices here, babe.\n\nEvery time he spills even a drop, he earns himself a sharp kick to the balls.\n\nIf he makes it through the entire day without spilling, reward him by grinding your wet pussy all over his face letting him savor the sweet payoff of total submission.",
    "tags": ["Scat & Watersports", "Humiliation", "Power Play", "Oral Focus", "Impact & Sensation", "Punishment", "Roleplay"]
  },
  {
    "id": 104,
    "title": "Mama Bird",
    "content": "This is a scene to truly feel in control of him.\n\nFor a day or meal based on what you prefer, he will only get to eat what you spit out in his mouth. This means no tasting any food directly\n\nThe only way he even drinks water is if you spit it in his mouth, play with him by pretending to spit it out but swallowing.\n\nTo toy with him even further eat all his favourite foods and chew it until the flavour is almost gone and then spit it back in his mouth.\n\nIf you find him eating or drinking anything tell him to look into your eyes, then slap him hard \"You get to eat only what I feed bitch\"\n\n",
    "tags": ["Oral Focus", "Humiliation", "Power Play", "Impact & Sensation", "Punishment", "Roleplay"]
  },
  {
    "id": 105,
    "title": "Slaptastic",
    "content": "Make your sub have a mouthful of water, and tell him to not spit it out no matter what.\n\nWhip him, kick his balls, spank him,etc.\n\nIf he doesn't spit it out you can reward him with sex or just a sloppy kiss all over his face.\n\nIf you don't want him to win you can slap him and that will surely get him to spit out the water.",
    "tags": ["Impact & Sensation", "Power Play", "Humiliation", "Punishment", "Roleplay"]
  },
  {
    "id": 106,
    "title": "Chill Day",
    "content": "This is for days where you just want to chill and not do anything. Make him lay down on his back and sit on his face. Sit on it like he's your couch.\n\nThen do whatever you want like read a book, scroll tiktok, watch a movie,etc.\n\nYou can have him eat you out or just stay there.",
    "tags": ["Worship", "Oral Focus", "Humiliation", "Power Play", "Roleplay"]
  },
  {
    "id": 107,
    "title": "My Spittoon",
    "content": "This is a fun game!\n\nMake him kneel on the floor and explain the rules.\n\n1. You will spit on his face for points determined by where it lands.\n\n    Forehead – 1 point\n\n    Cheek – 2 points\n\n    Mouth (closed) – 3 points\n\n    Mouth (open) – 5 points\n\n    Tongue held out properly – 10 points\n\n2. He must thank you after each spit — failure to do so means he loses all his points and starts over.\n\n3. If he flinches, wipes, or breaks eye contact, subtract 5 points.\n\n4. Once he reaches 50 points, reward him. That could mean a small treat, a kiss to the forehead, or permission to kiss your boot — your choice.\n",
    "tags": ["Oral Focus", "Humiliation", "Power Play", "Worship", "Roleplay"]
  },
  {
    "id": 108,
    "title": "Human Footstool",
    "content": "You don’t need furniture when you have him.\n\n\nMake him kneel down in front of your favorite chair. Have him place his forearms flat on the ground, shoulder-width apart, and lower his back until it's flat and parallel to the floor. Adjust him until he’s perfectly positioned — like the furniture he’s about to become.\n\nInstructions:\n\n    Command silence. He may not speak unless given permission. His only job now is to be still, stable, and useful.\n\n    Rest your feet on him — cross-legged, one heel digging into his back — however you’re comfortable. If he winces or shifts kick him and mock him of his weakness.\n\n    Read a book. Scroll your phone. Sip your drink. Occasionally glance down to inspect your furniture. Is he sagging? Correct it with a kick,\n  \n  Add difficulty. If he’s doing well, place a book or small weight on his back. Tell him he’s being tested for endurance — after all, real footstools don’t move.\n\n    Time it. Set a timer for 10, 15, or 20 minutes. Make him hold position without complaint. If he endures it, reward him. If not, remind him what he’s good for and start over.\n\nOptional Reward:\nLet him kiss your sole once, if he impresses you. Or maybe he just gets to be your footstool again tomorrow — if he earns that privilege.",
    "tags": ["Worship", "Humiliation", "Power Play", "Impact & Sensation", "Punishment", "Roleplay"]
  },
  {
    "id": 109,
    "title": "My Pony",
    "content": "Today, your sub is your loyal pony—your personal ride wherever you want to go.\n\nPut a leash in his mouth and make him get down on all fours. Tell him he’s your pony now, and he’s going to carry you around.\n\nWhenever you want to move around the room, the kitchen, or even outside he’s got to be ready to carry you like your own personal horse.\n\nHold his leash and guide him wherever you want to go.\n\nIf he slows down, stops, or tries to resist, dig into his ass with your nails or spank him.\n\nIf he still doesn’t listen, make him stay on all fours without moving for a set time as a punishment—no breaks, no rest, just waiting until you say otherwise.\n\nWhen he listens and moves right, praise him a little to keep him motivated.\n\nMake him neigh if you want.\n\nNo matter where you take him, he’s your faithful mount ready to serve and carry you anytime you want.",
    "tags": ["Humiliation", "Power Play", "Bondage", "Impact & Sensation", "Punishment", "Roleplay"]
  },
  {
    "id": 110,
    "title": "Marking Territory",
    "content": "You’re out in public, a busy café, a classy bar, wherever.\n\nWithout him noticing, you lean in and deliberately spit into his drink. Not just a little — enough so he can taste you, your control, in every sip.\n\nYou hand it back with a cold smile, locking eyes with him, and say, “Drink it all. No hesitation. No excuses.”\n\nIf he slows down or hesitates, you whisper right into his ear, loud enough only for him:\n“Refuse, and you’ll regret it later.”\n\nThe tension builds as he drinks, swallowing not just the liquid, but your dominance—right there in front of strangers who remain clueless.\n\nYou keep a firm grip on his wrist, squeezing lightly as a reminder: he belongs to you, and this little act seals it.",
    "tags": ["Oral Focus", "Humiliation", "Power Play", "Public", "Teasing"]
  },
  {
    "id": 111,
    "title": "The Foot Gag",
    "content": "You sit back, shoving your foot into his open mouth. \n\n“No moving” you command. \n\nHe tries to adjust, but you shove it deeper, reminding him who’s in charge. Watching him struggle to obey while gagging on your feet. When you’re done, pull your foot away, deciding if he earned praise or punishment.",
    "tags": ["Worship", "Oral Focus", "Humiliation", "Bondage", "Power Play"]
  },
  {
    "id": 112,
    "title": "Ball Buster",
    "content": "You have him kneel before you, eyes locked on yours. With every gentle kick to his balls, he must count out load “One… two…” focusing on each strike. \n\nIf he misses a count or hesitates, the next kick gets a little harder as a reminder to stay sharp. The light kicks keep him squirming, but the promise of a stronger one if he slips turns the counting into a tense, fun game where you’re always in control.",
    "tags": ["Impact & Sensation", "Power Play", "Punishment", "Humiliation"]
  },
  {
    "id": 113,
    "title": "Facial",
    "content": "Men absolutely hate the smell of their own cum, that bitter, salty scent that lingers. \n\nGive him a hand job and make him think it's a reward, after making him cum, take it and slowly rub it all over his face. \n\nMake sure he knows he isn’t allowed to wash it off until you say so. Watch him sit there with his face covered in cum.\n\nYou can also choose to not let him wash his face, the cum will solidify making him extremely uncomfortable but watching him squirm will be fun!",
    "tags": ["Humiliation", "Orgasm Control", "Power Play", "Teasing"]
  }
]
